{"RestaurantInfo": { "RestaurantID": "0_aeYE2-VbsZts_UpILgDw", "Name": "LAZY DOG RESTAURANT & BAR", "Address": "1725 FESTIVAL PLZ DR, STE A2", "City": "LAS VEGAS", "State": "NV", "Zip": "89135", "Longitude": "-115.333866775", "Latitude": "36.152831458"}, "Reviews": [{"Author": "D", "ReviewID": "kxscnA9nqyFqaTcvezUQ8g", "Overall": "4", "Content": "This place has nice staff and many cuisine options. The fluffy and seasoned pita bread with hummus is a great starter. I love the pan fried tofu with vegetables and the sparkling strawberry lemonade was very refreshing. However, I did not like the paper straw in the drink as it started to become flimsy after being saturated for so long and I could not sip to finish the bottom of the drink. Also, I had requested no mushrooms and my meal was served with mushrooms. I explained that it could have been more serious if it was an allergy as opposed to a preference, which is why I was frustrated having to pick them out. I also refused to wait for the meal to be prepared again, as I did not want my bf's food to get cold.   Nevertheless, the server and manager apologized and the meal was taken off of the bill. We will be back because they do show a great effort to please customers.", "Date": "2015-09-27", "AuthorLocation": ""},{"Author": "Mike", "ReviewID": "zaI81CwaiWT10BIEBFQvSQ", "Overall": "5", "Content": "Lazy dog is the best restaurant in town for dining with your dog. Also a awesome place for us humans too.", "Date": "2016-02-29", "AuthorLocation": ""},{"Author": "Bradford", "ReviewID": "jmwvhgZRyNkb616vegovTA", "Overall": "2", "Content": "A swing and a big miss. Now I know that this place was named after the head chef. Although the restaurant is very nicely appointed, and the brioche bun was quite nice, everything else fell short. Nachos with chicken marinated in salsa verde came wet and soggy. We ordered all the sauces on the side because we like chips to be crispy. But the chicken was soaked in green sauce, which made the whole pile a soggy, wet mess. Yuck. The burger, on that very nice bun, was a totally uninspired frozen patty, which was ordered medium, came out red inside and cold (not not warm, actually cold) inside. Disgusting. Fries were the most basic, unseasoned, dull fries you could imagine. Absolutely forgettable and without a drop of creativity. And, no manager ever checked on our table even though we saw three of them and it was not busy. Great location, nice looking place, nice looking menu, total flop for us.", "Date": "2015-09-06", "AuthorLocation": ""},{"Author": "Jade", "ReviewID": "V0yQ6NZ_XATjFDo7JMthgA", "Overall": "1", "Content": "Horrible. We were sat within the 15-20 minute wait time they quoted, outside with our pup and there was a dirty bowl of water and dirty bowl of rice on the ground under our table still not picked up. Fine. We ordered our drinks and food as well as new clean water for the dog with our waitress.  first up was our soup. It was very bland, and I had to add a generous amount of hot sauce to flavor it. At this point we didn't have silverware or napkins, only the soup spoon that had come with the soup which was a bit messy because of all the melted cheese. The water for the pup still wasn't out yet so I asked the food runner to please get us some. We sat and chatted for a while after we were done with our soups and before our main dish came.  When the main dishes came we still didn't have silverware or napkins. My friend had to ask for them, and when they came they were filthy. My first bite into the pot roast was cold! The gravy was dried up and you could tell just by the sight of it that it had been sitting out quite a while.  I let the waitress know it was cold, but it seemed like we always had to get her attention because she didn't even bother to check on us.  I didn't like the pot roast at all, it was cold to begin with. The second time around the gravy was not a solid, so I could see that it was at least warm but so so dry. I could barely eat it. We tried to quickly get over the horrible entree and order dessert which was not so bad, but the spoons were soooo dirty- like food gunk crusted on it dirty. After we finished we wanted to get the hell out of there because it seemed like we were there forever and we were- Almost two hours. We waited for her to come back to check on us, clear the table, and drop our check but she wasn't around. I stood up and just remained standing until she saw I needed the check asap so we could leave. She finally noticed me, and gave me the  I'll be right with you.   It was probably 5 minutes after that, that our check was dropped.  I wanted to use a credit card but I knew that would have taken years to accomplish with this service so I paid cash. I won't be returning to this place, the food was not good, and the service was awful!!!!!!", "Date": "2016-02-22", "AuthorLocation": ""},{"Author": "Tom", "ReviewID": "eKwYjQ8eUu6u5Ue8H2_GUA", "Overall": "5", "Content": "Absolutely delicious!  The whole family enjoyed the food and the atmosphere. The chicken pot pie, burgers, black and blue pizza, and chicken parmigiana were all great. Service was prompt/friendly. The 22oz Pale Ales were cold and smooth. We will return here frequently!", "Date": "2015-06-16", "AuthorLocation": ""},{"Author": "Patrick", "ReviewID": "bmFa_THOz2pPCDAvZNePvg", "Overall": "3", "Content": "So I originally wanted to give this place two stars but I will explain why it barely made the third star. First off I've only been here a couple times and within those times left a good enough mark on me to not want to go back or let it be my last option. So first time I went there was with my girlfriend and our dog. It took forever to get a glass of water and it took forever to order after the water. BUT WAIT.. No literally wait, because after the order was more waiting. I got so fed up that I was becoming uninterested with my food but it came. I tried their chipotle chicken quesadilla which I think is really overpriced which I can get better ones at Denny's for cheaper. And I got a side of French fries which I never got because they forgot and I wasn't about to wait longer because getting the check felt a lifetime. At least they didn't charge me for it. Second time I came with another couple plus my girlfriend and out dog again. Everyone got chicken Alfredo and one side of fries and I got the black and bleu pizza and Cajun fries. Yes I got my fries this time but the one guy who got the one side of regular fries didn't because they forgot. Saw that one coming. We got our table at 8. We wanted to eat and go get ice cream after but after all the waiting we didn't finish until 11. Trust me it was the same situation as my first visit. It was almost parallel to each other. BUT the reason and the only reason it barely made the third star is because their black and bleu pizza is absolutely amazing. I took it home and ate the leftovers the next day and it still tasted amazing. I don't know though if I would want to wait that long for a pizza. I guess it's nice also that I can bring my dog, but I'm better off ordering Dominos or Pizza Hut and relaxing with my girlfriend and dog at home.", "Date": "2015-09-05", "AuthorLocation": ""},{"Author": "Andie", "ReviewID": "R972_3CwkdiA-37sSfc7Hw", "Overall": "5", "Content": "I Enjoyed everything about this place. Great patio, delicious food and close to home! Sadly the Hubs almost died from too much hot spice on his burger BUT they took it off the bill and made it right. Will go back in patio weather for sure! Love seeing all the pups too.", "Date": "2016-01-06", "AuthorLocation": ""},{"Author": "James", "ReviewID": "8OV6GNxqwiiPtlpQN4P75Q", "Overall": "5", "Content": "This place is awesome! Been there 3 times already, the food is excellent, and they have very good beer. They are very reasonably priced to. Only complaint is the place is always packed.", "Date": "2015-06-12", "AuthorLocation": ""},{"Author": "Bradley", "ReviewID": "78WyhG5m931loFnCLyaphA", "Overall": "1", "Content": "The service is terrible.  Went there for the first time maybe a couple months ago for a birthday party.  We had reservations for a large group, it took a 1/2 hour past our reservation to get a table and then they gave use a table with not enough seats so we had to move our own tables.  Took another 1/2 hour to get a menu, 45 minutes to order drinks which I had to ask for again after my food was served to get.  Was there an 1 1/2 hours before getting the food which was okay but not worth returning for considering the terrible service.  Maybe its okay during the off hours but it is not worth it to me to return.", "Date": "2015-06-12", "AuthorLocation": ""},{"Author": "Allison", "ReviewID": "XysWN4RL_S6Pv-W2yV7RBA", "Overall": "5", "Content": "This was my first visit here and usually I reserve judgement until I have been two times or more but let me just say .. from the moment walking in our hostess Brenda went above and beyond to make sure we found a booth while also being seated in the bar to enjoy happy hour specials ... we arrived on a Friday afternoon and it was fairly busy which is always a good sign..  My date had been here before but this was my first time and I lucked out by having an amazing Waitress named Finn helping us . Hopefully I spelled her name right but either way I definitely recommend asking for her if you head here .. she's not only a beautiful soul ( totally aligns and relates and just shines the light ) she also has killer food recommendations and awesome taste in tv shows .. yes! Even that was discussed ..  Anyone who follows my reviews regularly knows I often suffer from service troubles at some of the strangest places lol but this was a stand out experience ..  I love how it's dog friendly and has such a variety of food .. now is it going to be a gourmet dining experience for the avid foodie.. probably not but over all I had a great time with great company while enjoying some yummy calamari and some fish and chips ..  I look forward to going back to try some beer!", "Date": "2016-11-05", "AuthorLocation": ""},{"Author": "Neil", "ReviewID": "31ai2jmm8TMzdB4ajuR7gA", "Overall": "5", "Content": "Had an exceptional waitress something close to jennifer. She kept all our drinks full and everyone happy all night. The food was good and the inside was great all night   Had the black and blue cheese burger it was great with the sweet potato tots and then got the cajun fries for happy hour which was from 9:00 pm to 12:00 pm.  Went with a work group was a great time overall the waitress deserved a raise she make everything amazing", "Date": "2016-06-08", "AuthorLocation": ""},{"Author": "Candace", "ReviewID": "SWaUaRlyGkoOMQwi1eQtgQ", "Overall": "2", "Content": "The Skinny: the food here is not that tasty. Portion sizes for the price are not that great(2) service was pretty standard (3) value: hard to justify coming back when there are better tasting restaurants nearby for way better price point. (2)  Went in for a quick lunch on a weekday and came away disappointed.  Just FYI -  this joint is highly popular with the Summerlin crowd.   I ordered the chicken pesto salad which came with a little scoop of sun dried tomato hummus and two miniscule slices of flathead. The grilled chicken had that rubbery texture and was rather pale color with some grill marks on it. It definitely was not tasty. Worse yet was the super odd pesto it was slathered in. The hummus was completely bland. To be honest,  I prefer the Sabra's (yeah! the listeria laced hummus brand) over the the hummus I tried here.  The marinated tomatoes were unpleasantly sour and mealy while the portion of greens was rather small. Meh,  definitely had better.  The hubs ordered the fish tacos which sucked. He only got two tacos which featured dry bland mahi mahi. The pico de gallo was tasteless. It was served with rice and beans.  The hubs thought the beans tasted straight out from a can. He'd rather hit Rubio's.   Service was solid and quick. We were tempted to send stuff back but we were in a rush and didn't want to bother. Instead we went home so I could wash the horrible aftertaste of the pesto from my mouth.   It's hard to justify coming back here when the food isn't even good. Portion sizes for the price are also not that great but then again,  do you really want more of a bad thing? Avoid this joint like the plague (2 starred review)", "Date": "2015-05-16", "AuthorLocation": ""},{"Author": "Monina", "ReviewID": "GgYdB6iY3UzsGJc5Az8W6g", "Overall": "5", "Content": "Why am I giving them a five star? Plain and simple, they accommodate for our four legged babies which for me is fabulous. I haven't brought my fur babies here but I just love that they provide service for them as well.  Food was okay, service was okay too. There was something missing and I don't know what it is. Maybe I should pay them a visit again to see if things have changed.", "Date": "2016-07-30", "AuthorLocation": ""},{"Author": "Sheryl", "ReviewID": "YOQcZIuGw5PhP_iYTxmW0Q", "Overall": "5", "Content": "We have been here a few times now!!  The food is always good.  We try to get our favorite server Fin (Amber). We love her always attentive and friendly!  We will be back!!! We have tried servers things on the menu and all have been good!", "Date": "2015-05-28", "AuthorLocation": ""},{"Author": "Arthur", "ReviewID": "cX6tU0NO52VzdW4MaufDCQ", "Overall": "4", "Content": "After a hike in Red Rock and needing to meet other family members for dinner, we decided on Lazy Dog. Everyone in our party of seven was satisfied with their food and we had an enjoyable meal. The casual atmosphere allowed everyone to relax and the large menu provided something to the liking for everyone in the group.  Arriving at 6:30 on Saturday night, we were first quoted a 45 minute wait. But when we denied the offer to wait, the hostess stopped us and offered us the long community table in the bar, which we accepted. Even though we were seated in chairs without back support we had plenty of elbow room. Service throughout the meal was excellent and they tackled our party without issue during a very busy dinner. Our server was quite friendly guiding us through the menu and the kitchen was efficient and there were no significant waits for anything.  The restaurant with the Rocky Mountain lodge decor and atmosphere has a large menu covering almost every cuisine. There was something for everyone in the group. I had the sticky ribs which were flash fried baby backs brushed with a molasses barbecue sauce. Your primary concern is that they  flash  fry the ribs opposed to deep frying them into leather. They did a good job as the ribs were fried perfectly with a crunchy outside and with moist, tender meat on the inside. I don't know if umami is an accurate descriptor of the fries, but they were still delicious. The portion did not completely fill me and I had plenty of room for dessert.  Also ordered were the chicken chile verde nachos, fettucine alfredo with chicken, chicken parmesan, house club, ginger soy salmon, carbonara, and the sesame crusted ahi. For dessert, the salted caramel creme brulee, butter cake,and white chocolate chip brownie. The nachos were full of toppings and did not last long on the table. The pasta weren't anything special, but sufficient for my daughter and her friend. The butter cake and brownie were absolutely devoured. I would recommend those two for sure if you have room. After we finished, the $$ price point for the entire meal was completely accurate.  Lazy Dog does a lot of things with their menu, but nothing is really outstanding. We did like the atmosphere and the family got to spend quality time together. Because the menu is so large, I wouldn't give up on them if you don't find something your first time around. Happy hour might be an ideal time to sample the menu because they offer a wide variety of food and drinks at very reasonable prices. I would have no problems stopping in for happy hour or for another meal.", "Date": "2016-06-03", "AuthorLocation": ""},{"Author": "Jon", "ReviewID": "2y7NVMiMRy5WyRRlhG3-yA", "Overall": "5", "Content": "Great place to chill out watch some sports, drink some good beer's and eat great food. My buddy and I came in the other night  and sat in the bar (self seating) James was our sever and had great knowledge of beers.We ended up getting a house stout and a coffee kolsh. Also totally changed my mind about brussel sprouts!!! They are a must try!!!  He also suggested the blue burger that was amazing as well. All and all great food,beers and service.", "Date": "2016-04-25", "AuthorLocation": ""},{"Author": "Anais", "ReviewID": "PR7o0cg7O9w1j69jvDC0PQ", "Overall": "4", "Content": "We ask for sitting outside and the whole time our waitress was beyond nice and helpful . He made sure we had everything we needed. We left happy and full  We loved everything! I can't wait  to come back and try new stuff .", "Date": "2016-04-20", "AuthorLocation": ""},{"Author": "DeAnn", "ReviewID": "e8uTVCWm0Ew8iG1PMm2d0Q", "Overall": "2", "Content": "let me start out with having  one of those days  was not going to help this review. we were waiting for a table and they passed us twice and then when we did get seated no one wanted to state that it was their table after we had to go to the hostess stand and tell them to send over the manager because hopefully they wouldn't be too busy to server us. Well a server came by and state that he noticed that we were sitting for a long time and that he wasn't our server but would be happy to get us started on our drinks, as he was walking away the manager walked up and our actual server was right behind her. The manager said that she was so sorry but there was confusion in who's table it was and that it was cleared up now and that  she  (pointing at he server) was here to take our order or answer any questions we had on the menu. The manager offered to comp our appetizers and to let her know if there was anything else she could do for us. She leaves and the server doesn't apologize at all and says so what appetizer would you like......I answered her and said  ok.....well I'm sorry would be nice considering the other server told us that you were our server and said that you were too buzy to get us and you were trying to get someone else to pick us up  she snapped back said  do you want me to server you or not  I was eye-balled by my family and so I decided to just order and get our food, considering how hungry my family was. It didn't stop there though. She was just rude the rest of the time and I let her know that I would never treat anyone the way she was treating us because it wasn't our fault that she let us hang for 20 minutes without even telling us that she would be with us as soon as she could. Not only that but why she couldn't let her boss know that she needed help with her section. She didn't snapped back this time, but just put the check down and walked away. this was the 1st and last time, never again!!!! I would of gone to the manager about her unbelievable disrespectful attitude, but seriously it was a waste of time....normally a manager thinks the only reason why a customer makes a complaint is to get free food and that is not the case......I figured I just read a review and let the people know the truth. The food was interesting and different. dogs at the table seem a bit weird to me, but I wont have to worry about that because I'm never going back!!", "Date": "2016-01-24", "AuthorLocation": ""},{"Author": "Laura", "ReviewID": "Ik3NKeAgL86qFCXGnKJtOA", "Overall": "3", "Content": "I've eaten here a few times and it's been good. The service is always great but they are usually very busy when I go and I have had my food come out wrong a couple times. Always gets fixed properly though. A tad on the overpriced side. I do love the brussel sprouts though!", "Date": "2016-12-04", "AuthorLocation": ""},{"Author": "Mags", "ReviewID": "9swEFC5XPKiZSlbcu6QQDg", "Overall": "5", "Content": "I went in the soft opening and did not have enough nice things to say.  I've since gone again and again.  This place is legit! I love the pastas and salads. The beer that they make is amazing.  My husband is rather well versed in beer (I know how cliche that sounds these days), but he too was impressed with the quality of their drafts and the glass cleaning system they use (apparently it's a big deal). I love the patio and the fire pit.  The service is amazing no matter where you choose to sit.    *I had to laugh at the knuckle head who yelped,  I do not go out to see dogs on patios.  Lol, I guess the name  Lazy Dog  did not give the fact away that it's a dog friendly establishment, but perhaps the bone door handles, the decorative fire hydrant, the dog menu...  You dress some people up, but you just can't take them out.   Haha.  I for one am glad there is ONE place people can bring their dogs.  I enjoyed seeing all the customers' happy pooches. I don't go to chuckie cheese and complain about kids, just sayin!", "Date": "2015-04-04", "AuthorLocation": ""},{"Author": "Palate", "ReviewID": "SW_D7RnEyYdf5xkHN_F_ug", "Overall": "4", "Content": "Went there with my family.  The service was outstanding.  Jenny was our server.  Very attentive and very warm personality.  The pace of the meal was spot on and they are very up front about if you don't care for anything or want anything special they can accommodate.   We had the calamari..not your typical battered calamari and had a sweet and tangy sauce on it.  Different but I did enjoy it. For the entrée I had the warm chicken on focaccia bread..loved it!  I tried some of my wifes pasta and fathers Chicken Parmesan.  If I had any gripe was that the food was a tad on the bland side.  Nothing a little seasoning couldn't fix. Overall it had a good vibe and a solid crowd.  Would love to sit on the psyio next time with my pooches.", "Date": "2015-05-27", "AuthorLocation": ""},{"Author": "Tamara", "ReviewID": "O_NEfGo7ZI84uNtnYA5i_A", "Overall": "4", "Content": "We really enjoy this place, the patio is awesome and I LOVE that it's dog friendly (as long as owners are smart and responsible). Food is consistently good, prices are reasonable, love happy hour, drinks are awesome and the staff is always so welcoming and friendly! One of my favorite spots in downtown summerlin for sure", "Date": "2016-03-17", "AuthorLocation": ""},{"Author": "Kathleen", "ReviewID": "CGu6chhdM2ZLejD-3tkWmA", "Overall": "2", "Content": "My husband and I along with our daughter and grandson ate at the Downtown Summerlin location of TheLazy Dog this past week. I usually enjoy leaving positive reviews because I believe too often, people share anything that is bad and usually not the good. But, unfortunately we had an awful experience at the location. I ordered the turkey with cranberry salad sandwich. It had very little flavor.  My husband ordered shrimp tacos and honestly there had to be half a head of lettuce left over after eating the tacos. He said all he could really taste was the lettuce. My daughter ordered a pizza and had to wait over 20 minutes for a waitress to return so we could ask for red pepper flakes. Granted, this was 12/23  and the place was busy with holiday shoppers, but that doesn't excuse waiting 15 minutes just to turn in drink orders. Then we waited again to turn in food orders. Once food was delivered, we did not see our server,Isabel, again for at least 45 minutes, we only saw her because we snagged another employee to please pass a message that we needed more drinks since we'd been out for over a half hour by now.  Being without a drink for 30 minutes is no easy task when faced with a flavorless turkey sandwich and a head of chopped lettuce. I loved the atmosphere in their restaurant and although I though the staff was friendly, I won't be returning. My husband and I make it a habit of leaving 25% minimum tip but in this case, Isabel only received a 4.00 tip on a 50 something dollar tab. I figured I should tip because we did get our drinks and the correct food thaws ordered.  The fact that we didn't enjoy the dishes is not her fault but that if the cook. But giving a smidgen of attention to your customers might turn out good In the end", "Date": "2015-12-27", "AuthorLocation": ""},{"Author": "David", "ReviewID": "jBg6ZdCa5Eo61Hf62XuG7g", "Overall": "5", "Content": "Absolutely love this place! My family and I go at least once a week. Last night our server, John, was great. All the staff seem very attentive and happy every time we go. Food has always been consistent and delicious. Great place for entire family, including dogs on patio, which is hard to find in Vegas. The butter cake is my favorite dessert in Vegas. All the apps are a fantastic way to start a meal. The ambience has a very California, calm appeal.", "Date": "2015-06-21", "AuthorLocation": ""},{"Author": "Shaina", "ReviewID": "iOxrPi5IxF9QQfWOmyuhYw", "Overall": "5", "Content": "I love this place! I finally found a place that I can bring my pup and they even have a dog menu!!!  Moving from Los Angeles where almost every restaurant has a patio and is pet friendly, I was so happy to hear about this place!  My party of 4 (3 plus a dog) showed up for lunch at around 11:30am. The hostess saw us from afar once we parked and walked towards us to greet us warmly. This was such a nice gesture. It really made us feel welcome, especially since it was all of our first time coming to the restaurant. We were seated immediately and introduced to put server. I wish I got everyone's name but I was too busy running around making sure Hilo (my dog) was secured appropriately (his leash tied to a chair). The server was very professional, very nice and accommodating. He brought out a water bowl for the dog immediately.  The server brought out a complimentary flat bread for first timers, which was very tasty. We ordered an Poke Bowl, Ahi Tuna Salad, Hawaiian Ribs with fries, Edamame, and a Tuna and Walnut Sandwich. All great choices but my absolute favorite were the ribs! Definitely a must try!!!  Before our meal came out, the manager also introduced himself to us. The staff really goes above and beyond to make sure everyone feels welcomed and it did not go unnoticed and was very much appreciated.  Hilo my dog is on a raw diet so he unfortunately could not try anything from the dog menu but we will definitely be coming back as he loved the restaurant and the staff!!!", "Date": "2016-10-07", "AuthorLocation": ""},{"Author": "Bradley", "ReviewID": "gy4f4U_1nL1jGJtzgfLJxw", "Overall": "3", "Content": "Came here on a Wednesday night for the happy hour from 9-closing. Friends and I ordered almost every happy hour app and almost all of them were very good. The only one we didn't like we're the Cajun Fries and the chipotle ranch sauce on the side. Too much for us. But everything else was great and the house brews were very good as well. My personal favorites were the stouts, IPA, and lemon", "Date": "2015-04-02", "AuthorLocation": ""},{"Author": "Greg", "ReviewID": "a2mEWQvu4Yti1TaZjJeFcQ", "Overall": "5", "Content": "Great environment to dine in. Love the service and the fact you can bring your dog.  Love ordering the Ahi Tuna, this dish is excellent and is highly recommended. The butter cake is probably one of the best desserts out there. Great Summerlin location, try", "Date": "2016-12-04", "AuthorLocation": ""},{"Author": "Matthew", "ReviewID": "X9nxDTQNffXHonlxDvTBkg", "Overall": "1", "Content": "- Our food was very bland and dry - We had to find our own waiter to order - wait time was one hour - dog at next table bit the waiter's foot twice which made me feel unsafe to have my dog - chaotic patio  - low standards of service", "Date": "2016-02-13", "AuthorLocation": ""},{"Author": "Burden", "ReviewID": "RNWQ_u5532J59tuSodql_w", "Overall": "4", "Content": "If you want a cold drink and some good food in Summerlin, you can't go wrong at Lazy Dog.  We like to sit on the patio with the dogs and take in the fresh air. Nice variety on the menu from bar food to dinner entrees.  Reasonable price and nice assortment of beers.", "Date": "2016-05-24", "AuthorLocation": ""},{"Author": "Johnny", "ReviewID": "wP8vF1AJ3MyTsJWmx_rt8A", "Overall": "5", "Content": "Far and away the best service I have had at a restaurant in Vegas. Went here for Mother's Day. The food was great and delivered quickly. Small issue with one dish that was immediately remedied. The chef and manager came out to make sure it was corrected!  Natalie/Natalia? Our waitress from Orange County was amazing. The strawberry bunds cake was one of the best desserts I have ever had. Thank you! We will be back!", "Date": "2015-05-11", "AuthorLocation": ""},{"Author": "Trisha", "ReviewID": "TkH2Dv02hwZ4Ubv0ynSSIw", "Overall": "5", "Content": "I've eaten there twice already!  Service is great - multiple managers stopped by as well. I love the cucumber martini and Maggie's Snake River salad!!", "Date": "2015-04-05", "AuthorLocation": ""},{"Author": "Pat", "ReviewID": "kdneRtFiwo1i1W-12aD_sA", "Overall": "5", "Content": "Very good place to eat. Great service and great food. We had Alina as a server and she was very attentive and friendly! I would suggest this to anyone looking for a place to eat.", "Date": "2016-04-22", "AuthorLocation": ""},{"Author": "Shelly", "ReviewID": "9ANkZD8_W_nWOlcGp7ay0g", "Overall": "4", "Content": "Came to eat here with my mom, baby, and puppy. I think our waitress's name was Daria. She was very nice and brought water out for my puppy and again when my mother knocked the first bowl over. My puppy had the hamburger patty and rice which she made a mess with but enjoyed all the same. I had the roast beef dip with fries. The sandwich was good but the fries were kind of bland but at least they weren't greasy. My mom had a cheeseburger with the sweet potato tater tots. She said it was good but the sauce that came on the side was a bit spicy. This was my first trip to Lazy Dog in Summerlin (I've been several times to the one in Valencia, CA. I even went there on my first date with with my husband) and I would certainly go again. There should be more dog friendly restaurants out there, in fact.", "Date": "2016-04-24", "AuthorLocation": ""},{"Author": "Corbin", "ReviewID": "YEtlEO8jQyZDInNIP7YMjw", "Overall": "5", "Content": "This restaurant is amazing. The food is incredible. It was out first time here and the general manager bought out table an appetizer to welcome us. The customer service is remarkable. The pot roast is to die for. And the prices are very reasonable. Perfect night. Defiantly coming back. Only this time we are bringing our dog, Diezel.", "Date": "2015-11-21", "AuthorLocation": ""},{"Author": "Alex", "ReviewID": "k9aZtg96WhZjE-d7GXoX6g", "Overall": "5", "Content": "We come to Lazy Dog all the time! It's our favorite.  Great atmoshpere, great service, exceptional food, and a fun outdoor dining area.", "Date": "2016-09-27", "AuthorLocation": ""},{"Author": "Chris", "ReviewID": "vV9vAUCNFNDHptqAESDujw", "Overall": "5", "Content": "Can't beat the late night happy hour! Cheap and delicious drinks and apps. My girlfriend and I always sit at the bar and think all the bartenders are fantastic, friendly and attentive. LOVE the sangrias, the high altitude chicken tenders, the calamari, the pizza, everything I've eaten here has been delicious. And of course, dog friendly! By far our favorite bar in downtown Summerlin. If you haven't been here yet you are seriously missing out.", "Date": "2016-12-02", "AuthorLocation": ""},{"Author": "Laura", "ReviewID": "r_hyR0bwFuA7mqqVeQ2ziQ", "Overall": "4", "Content": "First time coming here yesterday and I would say its a must come back too. I only give it 4 stars because I went around 12 and it was a slower time so not sure how their service would be on a busier time. I brought my dog with me so he can feel special and it was nice to find a nice restaurant that allows dogs. We sat outside fast and great service from the start, I acknowledge the rules for my dog even though seeing another dog he almost ruined it ha but he learned to behave there and just lay down until food came. The pricing for food and what you get from it was well worth it. It gave you the fancy atmosphere with out the expensive pricing you think to expect. I would definitely recommend this to my friends with dogs to go to even if you don't have dogs I would say give it a try too, I'm just not sure how it is during a busier time how everything is.", "Date": "2015-08-06", "AuthorLocation": ""},{"Author": "Rachelle", "ReviewID": "HtcMRXI7vjE-FdHbCtrq0g", "Overall": "5", "Content": "I came here for dinner last night Prices are actually pretty reasonable and the service was GREAT! We ordered a few appetizers (flatbread & Brussel sprouts) and then chicken parmesan & fettucine. I made a huge mess all over and spilled sauce. I felt so bad but our server was great! (Kati) She took care of it without making me feel horrible about it. I Would definitely come back again!", "Date": "2016-12-13", "AuthorLocation": ""},{"Author": "Robert", "ReviewID": "7lZHoC1CwAlGLGHsMFOI_g", "Overall": "5", "Content": "Nice comfort food restaurant.  Service was outstanding, apps were excellent, especially the nachos.  Main courses were huge and flavorful, bring your appetite.  Bison meatloaf was unique and my wife enjoyed the pot roast.  Also, very reasonable on the price, we will return.", "Date": "2016-07-17", "AuthorLocation": ""},{"Author": "Hayes", "ReviewID": "Wl_RgVg0F12t2Sdjwy1YuQ", "Overall": "5", "Content": "Great experience! Great food and Dariah our server really understands the meaning of hospitality will be back", "Date": "2015-06-13", "AuthorLocation": ""},{"Author": "Scott", "ReviewID": "r36weryp_ZLW0cipbjQsHw", "Overall": "1", "Content": "I only gave it a star because I had to in order to post. This was arguably the worst service I ever had in a dining establishment. The food was  eh , but it was the best part of our visit. We only saw our waiter when he took our drink order and not again until we had to have someone  fetch him  (pun intended) to bring our check. Then we had to find him again to pick it up. We're locals and the place looked promising. It wasn't.  Maybe it was just the waiter we had, but it ruined the place for us. We won't be back.", "Date": "2015-11-04", "AuthorLocation": ""},{"Author": "Hassan", "ReviewID": "AJt2_MeZKKr4KgQIBMy3iw", "Overall": "5", "Content": "Great place!  Food was excellent and so was service.  Ahi Poke, Hatch Chili Mac & Cheese, Black & Bleu Burger with Cajun Fries were all great!  Shaun was a great server and will come back to this restaurant.", "Date": "2015-04-08", "AuthorLocation": ""},{"Author": "Courtney", "ReviewID": "TyTaEvyNzqoXn7G67hJQ4Q", "Overall": "5", "Content": "Incredible tasting food at stunning prices! Electric, upbeat atmosphere in the dazzling Downtown Summerlin location. The environment makes you feel like you're at a huge Friday night party.  The portion sizes are hefty enough for two people to share one plate, so the prices are definitely justified. Servers are all over the place because its insanely busy, but none of them seemed like they'd rather die than be there. Jennifer R. was as attentive as the high speed environment would allow and sincerely friendly.  Jennifer and another server highly recommended the butter cake desert. For fans of sugar cookies, pound cake and ice cream, it's an amazing treasure. Pure joy on a plate!  Will definitely return. :)", "Date": "2015-09-06", "AuthorLocation": ""},{"Author": "Georgia", "ReviewID": "XhIs3QJdYiJ9-Bod9RSqhQ", "Overall": "5", "Content": "Awesome food and people. The patio is very nice and  will defiantly come back. It's not expensive either.", "Date": "2015-06-20", "AuthorLocation": ""},{"Author": "Kelly", "ReviewID": "0ugS0BF7f478I2cjrhDfsg", "Overall": "5", "Content": "This is our new go-to spot in our area. Aside from the fact that we can bring our boxer boys, it is a refreshing change to the Summerlin bar atmosphere. Just read that every Monday during football season has happy hour all day long. We love the wok dishes, buffalo bites, wings and my Hubs loves the lemon chicken caper pasta. A few times when service was slow (we've been here 20+visits) a manager greeted us with a smile. Keep it up, Lazy Dogs!", "Date": "2015-09-07", "AuthorLocation": ""},{"Author": "Colby", "ReviewID": "qHXtdEAjG7mcjsnG3O1LXQ", "Overall": "5", "Content": "My interest was piqued when we first saw this place being built at Downtown Summerlin and read about the strange concept coupled with great reviews from their California locations.  Well, we finally went this weekend and it was a very cool joint.  The place was absolutely packed with humans and dogs alike. We didn't have our dog with us, so we sat indoors in order to get a seat sooner.  The menu is pretty extensive and covers a wide variety of cuisine-types. My girlfriend and I both ordered off the lunch menu. I had the spicy garlic chicken noodle bowl and she had a personal pizza and salad. Everything was great.  They carry beers from the Pub at Goldenroad out of LA which is a big plus for us.  Atmosphere is pretty nice with a modern lodge feel and quite a few large tvs around the bar area.", "Date": "2015-05-27", "AuthorLocation": ""},{"Author": "Tom", "ReviewID": "DTwTd9YZpXF6cGEdg1CEQw", "Overall": "4", "Content": "High end bar food that is actually good, better than other places. Main dishes $$$, but lunch specials are actually reasonable and good!!! Our server, Arizona, was awesome. Her humor and helpfulness made our experience more memorable. First timers get a free appetizer and don't forget to check in because you get free Cajun fries!!!!", "Date": "2016-09-06", "AuthorLocation": ""},{"Author": "Bonita", "ReviewID": "hVHVOWZPuIl-sEcdXEfHKg", "Overall": "5", "Content": "Let me start by saying how amazing the customer service is here. The other night my family and  went here for dinner. The manager (I'm guessing) was so polite. He made us feel welcomed like and comfortable. Te little gesture of helping my brother take his jacket off was very impressive. He continuously walked around and made sure everyone, not only our table, was having a great experience. He even offered to turn off the fire place because we had long sleeves and what not on. The food is good. We had the chicken nachos, wings and tuna poke to start all were very delicious. The nachos are a big portion. we were full off of the appetizers. We ordered the lamb shank with mashed potatoes it was yummy! the lamb was so soft and juicy it literally melted in your mouth. The make your own pizzas on the kids menus take  a little longer so i recommend starting it right before or around the time you start appetizers. I love the fact that any burger can be substituted with a turkey burger. Over all the ambiance is great, the food is delicious, the customer service is always great.", "Date": "2015-12-05", "AuthorLocation": ""},{"Author": "Marc", "ReviewID": "NnDJV_AgbSga0LTHMAmFWA", "Overall": "4", "Content": "Ok. Gave them another shot. I had a pretty good burger. The apple crumble was good too. Only issue was that they gave my wife cafinated coffee when she ordered decaff, no she has the shakes.", "Date": "2015-11-30", "AuthorLocation": ""},{"Author": "Melanie", "ReviewID": "BAEUo31VHuvdqaINNi9ItQ", "Overall": "3", "Content": "My friends and I came here for a quick dinner before heading to the strip because the restaurant was close to a condo we were staying at. The restaurant was pretty crowded because of the dinner rush. We were seated after about 15 minutes of waiting.   Our table shared Cajun Fries and a Brick Oven Spinach & Sundried Tomato Cheese Dip for starters. The dip was too salty for me. The fries were okay.   I chose to share a chicken pot pie and a Tex-Mex salad with my friend since we wanted both things. The chicken pot pie was huge, but it only had a crust on top. It was basically the easier way to make a pot pie. The pot pie also had huge chunks of chicken which I didn't enjoy because that's basically all you would eat in one bite. The Tex-Mex salad was good and very big. Next time I would probably do without the black beans since I'm not a fan of them. The dressing was a nice accompaniment too.   Our waitress was very friendly and helpful with all the questions we had. Overall, we had a decent meal here.", "Date": "2015-07-19", "AuthorLocation": ""},{"Author": "Adrienne", "ReviewID": "SA0y_1spe2qMfm2SX8VYxw", "Overall": "5", "Content": "I wish I could give Lazy Dog restaurant and bar more stars. I absolutely love this place and can't get enough of the food. We have sat inside and out on the patio and I have to say, the patio is my favorite. I am so glad the company has broadened outside of California and have made Downtown Summerlin their location in Las Vegas. We love to eat and then go shopping. I recommend the trio hummus and the chicken lettuce wraps and then the butter cake for dessert. I have brought my dogs a couple of times too. We always have a great time!", "Date": "2016-04-24", "AuthorLocation": ""},{"Author": "Mai", "ReviewID": "371s3BXQVYdtaHLCQ11jPg", "Overall": "4", "Content": "Met up with a friend I haven't seen while here. Before eating here I looked up the place. I mentioned to her that she can bring her dog if she wants and the menu seemed to offer a good variety of food. She ordered a sandwich off their lunch menu and I ordered the fried chicken.  Chicken was good but it's more like chicken fried steak. I was expecting traditional fried chicken. Still it was a delicious meal so not a big deal, though I'm sure future patrons who are pickier will point that out.   I also had the jamaican lemonade? It was very tart. It probably could use more sugar, or less lemonade.   I would come again here if I'm at Summerlin side of town. Would like to try the rest of the menu. Price is very good as well.", "Date": "2015-05-30", "AuthorLocation": ""},{"Author": "Allen", "ReviewID": "J84lrpf0fZUogXhB00IHsg", "Overall": "2", "Content": "I walked in and asked to be seated on the patio. When I walked out on to the patio I noticed there were literally dogs out on the patio. Now I get why they call it Lazy Dog. Needless to say, I sat inside.  The food was just average pub food. Margarita Pizza, Fish Tacos, Fish & Chips, and Tofu Stir Fry. No need to go through each item. It was all average and over priced. The homemade ginger beer was good, but too sweet. I had to exchange it for an iced tea.  They have a cool bar with quite a few beers on draft. They also have a happy hour menu and the margaritas look good. I will probably be back to have a drink at the bar, but the food did not impress", "Date": "2016-02-26", "AuthorLocation": ""},{"Author": "Jane", "ReviewID": "k75ZqFcYT0SfUK6PJjvSxA", "Overall": "1", "Content": "Not sure how this place got 4 stars. This place is a joke of an establishment. We waited at least 20 min to even get an order in. I had a group of people with 4 dogs total. We suggested to come here because of the great reviews and it's dog friendly! The food took forever to come out as well. The service is so slow, I swear coming out of that place, I aged another few years. I was better off in a long ass coma than to be there. Fascists don't got nothing on this place when it comes down to a slow and painful death... Ok, on to the food review.  We ordered the Hawaiian poke. That's a slap to the Hawaiian people. This poke was on a tortilla chip with smeared guacamole and 3 pieces of small tuna. I wouldn't have even fed it to my dogs. Next, the pizza. Wtf, seriously, the pizza wasn't even a pizza. I ordered the all American burger. It was so gross, I couldn't even eat half. It came out so cold, I felt like I was eating a hamburger that came out of a refrigerator. Even North Korea wouldn't feed it to their enemies. The vegetable lasagna. Oh Jesus.. Where do I even start in this. It reminded me of lean cuisine. Prison inmates get fed way better than this slop. What was the best part of the meal? The dog food I ordered. I ordered the grilled chicken and hamburger with brown rice. It was the only thing that looked fresh and delicious. Yes, the dog meal looked way better and apparently tasted way better than the food because someone in our group was still starving because they didn't want to eat their own food. They said the grilled chicken was really good. Be warned, if you come here, just order the dog food, you'll get a better meal than the slop they serve.", "Date": "2015-07-17", "AuthorLocation": ""},{"Author": "Marci", "ReviewID": "pvzCWT1R8piALUjs6nJ96g", "Overall": "5", "Content": "Great for a large group. Lots of options. Great service. Something for everyone. Dogs are outside which is great to those wanting an inside, dog free dinner. Win win for everyone.", "Date": "2016-09-18", "AuthorLocation": ""}]}