{"RestaurantInfo": { "RestaurantID": "_4tMcp2SGyG4bJzB_t7n8A", "Name": "EL MICHOACANO", "Address": "4388 E CRAIG RD, STE 125", "City": "LAS VEGAS", "State": "NV", "Zip": "89115", "Longitude": "-115.0783644", "Latitude": "36.2410432"}, "Reviews": [{"Author": "Candi", "ReviewID": "TsmYPIATZBAd-87ChUncRg", "Overall": "5", "Content": "I love this place. The chamango (sorry if i spelt that wrong) is the BEST! ... the staff is so kind and very helpful. I would definitely recommend.", "Date": "2016-05-10", "AuthorLocation": ""},{"Author": "Lawrence", "ReviewID": "hy1v58PyHGLf9KLVACqBVw", "Overall": "5", "Content": "Been open since September 2014 and still haven't received a review?? Wingman to the rescue:D  Owned by a local family. The inside is very clean and fresh plus if you are looking to hang out, they have a pool table to enjoy.  About 22 flavors of ice cream, including a few Mexican favorites for only a buck and some change!  I always enjoy their Chamango on a hot day. If you never had one and love Mexican candy, you missing out, bruh! Unfortunately, they had to let go of their taco vendor that cooked outside since the fact that not much business was getting through to them.  Stop by and support the only ice cream shop by the base next door to Port'o Subs!", "Date": "2015-04-17", "AuthorLocation": ""},{"Author": "Davina", "ReviewID": "5bbQp51VZBBgW_eybim3Uw", "Overall": "5", "Content": "Awesome family owned business. Good variety and awesome location! Nice spot so that you don't have to drive to the east side for your cravings. Check it out! You won't be disappointed.", "Date": "2016-12-27", "AuthorLocation": ""},{"Author": "Terri", "ReviewID": "sDIuyicROZDGHs46wQlIIQ", "Overall": "5", "Content": "Why are you not here? Locally owned.  Serves Thrifty Ice Cream.  2 scoops for $3.20.  Clean!  Family is super nice.   A customer cane in with a large bill & they couldn't break it.   The owner gave them  the ice cream &tells  the customer to come back & pay another time.   Who does that anymore?   I will be back again & again!", "Date": "2015-09-20", "AuthorLocation": ""},{"Author": "Christephany", "ReviewID": "sqSJoTs1AjADAjQG48UHIg", "Overall": "5", "Content": "I love going here now because it's the closest place near base I can get a little bit of home back in Hayward, CA with their elotes and mangonadas. They also have thrifty ice cream including my favorite flavor, chocolate malted crunch so it's even a bigger plus for me. I think I purchase from them at least once or twice a week since I've found out this place. That kinda tells you how much I love this place lol.", "Date": "2016-01-23", "AuthorLocation": ""}]}