{"RestaurantInfo": { "RestaurantID": "_5wi2C7x68Bt14qhdCqi1Q", "Name": "ROBERTO'S TACO SHOP", "Address": "6355 N COMMERCE ST, STE 103A", "City": "NORTH LAS VEGAS", "State": "NV", "Zip": "89031", "Longitude": "-115.1440982", "Latitude": "36.2745259"}, "Reviews": [{"Author": "EJay", "ReviewID": "oAsvFAc-nxIYodOZpghNbQ", "Overall": "4", "Content": "Carne Asada chimichanga...very good and tasty!!! The flavor and marinade is good. Lots of food for your$$$$. They have chicken tacos on special for $1.20 each. Quite a great deal if you ask me. The staff is very friendly and professional. Robertos is always awesome for anytime munchies.", "Date": "2010-11-01", "AuthorLocation": ""},{"Author": "Josh", "ReviewID": "B2JTTXBQ_exrvyOYWsy6RQ", "Overall": "5", "Content": "FOOD: I haven't found a single thing I don't like from the menu. The only thing that's kind of a rip off was the Fish Tacos. They're pretty much a fish stick with dressing, lettuce and a taco shell. I will mention that the Chicken Chimichanga is unbelievable. Best mexican food thing I've ever had. Only problem with the food is that they put Guacamole on everything which I don't like at all. You can easily order it without. Also once the Mountain Dew wasn't actually Mountain Dew and was orange.  EMPLOYEES: Don't go during the day! There is one of the nastiest cashiers I've ever met there. She doesn't where a name tag but she is a 20 something year old mexican girl. My girlfriend changed her mind last minute that she wanted a drink and the girl rolled her eyes and was completely inappropriate about the whole thing. We now only go at night and the girl at that time is as nice as could be.   ESTABLISHMENT: It's never been dirty when I was there but it is a little dingy and dark. We usually get food to go though.", "Date": "2013-04-05", "AuthorLocation": ""},{"Author": "Nikki", "ReviewID": "a9OkNTTLTgdvgvDtToKDsQ", "Overall": "5", "Content": "Carne Asada Fries are amazing. You can't go there without trying them. The tacos are okay, beef chimichangas are pretty good also and so are the enchiladas.  My go-to place when I'm craving Mexican food!", "Date": "2014-09-02", "AuthorLocation": ""},{"Author": "Irene", "ReviewID": "FsMgGSlhFNtqh3DuK_U4yQ", "Overall": "1", "Content": "Ordered a breakfast burrito. Got an egg burrito! Food here sucks..SMH been here twice and disappointed both times. Defiantly not returning a third time!", "Date": "2016-10-02", "AuthorLocation": ""},{"Author": "Mel", "ReviewID": "vtbexpQx-ZOxBMR0vlIExA", "Overall": "4", "Content": "Every once in awhile I'd see this place and think...looks like some of the taco shops I go to in Southern California.  But I would never try it. Coming from San Diego (15 minutes from TJ), I became a snob when it came to taco shops out here.  I had this attitude that no taco shop in Vegas can come close.   After reading some of these reviews, I thought I give this place a try.  I was starving and been to plenty taco shops that can mess up a carne asada burrito and carne asada chips.  You know how it goes??  You're hungry, but at the same time in no mood to experiment.  So, I naturally played it safe and went with the rolled tacos.  I'm not going to say it was the best rolled tacos that I've ever had, but it was good enough for me to come back.   I didn't give this place 3 stars or 5 stars because I didn't really try anything special.    I still need to try their -Carne Asada Fries -Carne Asada Chips -Carne Asada Burrito  If this place can deliver on any one of these, I will change my rate to a 5.  One wish regarding the rolled tacos...I wish they had the mixed white cheese with the red tips.  If you're from California, you know what I'm talking about.   Overall, this places has me curious on how good it really is.  I will be back to find out.  This place reminds me a lot of the taco shops in San Diego, compares to Alberto's and Sombrero's.  One positive for sure is the service, cleanliness, and it's open 24hrs.", "Date": "2012-08-21", "AuthorLocation": ""},{"Author": "Michael", "ReviewID": "DnxaHvv8a4V_aDGA1sg_Bw", "Overall": "3", "Content": "Well, what can I say...It's Mexican food Fast! And I'm a white guy! We usually like the food here...Try to not eat there due to some gross looking tile and grout that there cleaning with dirt and grease from the parking lot...The utensils to grab the vinegar carrots with is always buried in the salsa...Typically some 400lb lady with her belly is hanging over the counter as well grabbing like a tupperware full of carrots and jalapeños out the door...The bathrooms here are nasty (i hold it for as long as possible) Those beans have quite a affect on your colon...One other observation in the store is , if you look to the right where the cashier is, take a good look at that 50 Year anniversary poster is, I swear thats a picture of Judge Judy and some Man from Home Depot...LOL", "Date": "2014-07-27", "AuthorLocation": ""},{"Author": "Shokouh", "ReviewID": "NMepOWX00BEeLQp-P3ziyA", "Overall": "4", "Content": "(Positive) Big portions for the price and the quality is good too + I like their salsas.   (Negative) They don't offer water cups nor do they have even water at the fountain. :-/ I was a little disappointed about this because I don't drink soda and I didn't want to pay so much for bottled water.", "Date": "2011-01-11", "AuthorLocation": ""},{"Author": "I", "ReviewID": "G7S7xam2z_jxMG5JoM0Zyg", "Overall": "1", "Content": "This place could really use a number system when ordering food.  Countless times I see people walk out with someone else's order...seems like a simple fix.", "Date": "2016-01-14", "AuthorLocation": ""},{"Author": "Bellez", "ReviewID": "S9T4cNHJNv6DmVrrFcKfHQ", "Overall": "5", "Content": "Tried 2 restos on Rainbow and the Robertos on Commerce in N. Las Vegas. So funny how all 3 restos are very different in taste considering they are owned by the same person. My fave location has got to be Robertos on Commerce on North LV. Their carne asada is so delish! Seasonings on point. Their Carne Asada Burrito and Nachos are always hot and fresh and just so tasty. Their red hot sauce is thick and super hot the way I like it. Employees are nice and obviously are great cooks", "Date": "2016-05-04", "AuthorLocation": ""},{"Author": "Jacob", "ReviewID": "iZvJTyj0HGu_50Q7ihG1tQ", "Overall": "1", "Content": "This place made me sick... Literally! I was throwing up and had diarea for 2 days.  The interior could use a good cleaning and the service came with a healthy dose of  bad attitude !  At least the prices were cheap-but you get what you pay for. Skip this place, you'll be glad you did!", "Date": "2014-09-28", "AuthorLocation": ""},{"Author": "Marcie", "ReviewID": "KSK4cgHI6O-sGs92QJVH2w", "Overall": "2", "Content": "The food is good but the service is terrible. Each time I have been here the workers at the register are incredibly rude to the guests. You are much better off at the location on Losee and Ann.", "Date": "2017-01-06", "AuthorLocation": ""},{"Author": "Johny", "ReviewID": "BXk9N9OBko7rKaaQKWqbUQ", "Overall": "1", "Content": "So I went ordered serveral food items with a horchata well unfortunately the machine was out so instead of say I'm sorry we are unfortunately out right now it's gonna be few min. to make it did you still want it or no they 1 younger girl went to the back and I'm what they did or whipped up but came back and have me a drink which looked off so I took 1 tiny sip and was horrible I told they lady that brought me the drink and I told her this tasted horrible and she said  oh I didn't make it  so I told her can I just get my money back for the drink they looked confused and started speaking in Spanish and then ask me if I wanted to try another one they just made I said no and said it's okay jus out the drink credit towards another burrito and I'll pay the difference so she said ok 4 more dollars I said ok and the whole time they were jus starring and like chit chating in Spanish like if they were talking trash I purchased over 44 dollars worth of food and left tip and this is how your gonna treat your customers ....very very disappointing and I will not be gonna back ever to that location or any Robert is for quite some time I believe their food is pretty good but workers their all lack the courtesy and this goes with several other locations if your not happy where you work go somewhere else!!!", "Date": "2016-03-03", "AuthorLocation": ""},{"Author": "Mario", "ReviewID": "uZc8sMBnLGOcU5uByrQ89g", "Overall": "2", "Content": "The lady behind the counter is hella RUDE!!! She made a mistake on my order  and when I went to tell her about it she blamed it on me! Lol.. Smh.. She needs to get fired!! Not my fault she hates her job making minimum wage!!!", "Date": "2014-05-17", "AuthorLocation": ""},{"Author": "Jesse", "ReviewID": "8YRsPMzmndB1uCiQ8Mq0XA", "Overall": "1", "Content": "There is a real attitude problem at this Location with the two Men that were working tonight on Oct 2nd.   The cashier was extremely rude, and needs to be talked to. He has no customer service skills can barely understand English. I'm not saying he doesn't know but you work in a restaurant, you are going to have many different people coming in. And if Spanish is all you can speak being a cashier probably isn't the best position for him.   But I ordered two chimichangas and two carna fries and with one meat one the side.  They got my order wrong the first, and the second. My fries still came with all that meat. And the cashier walked to the back as they put my order up and didn't come back up. I will definitely being coming back to speak with a manager.", "Date": "2016-10-03", "AuthorLocation": ""},{"Author": "Gina", "ReviewID": "s_oEOf-vEq8iuPx-JWFI0Q", "Overall": "4", "Content": "I just noticed a recent review near me. I go here a lot too. I have to agree it is good mexican food anytime of the day or night at a fair price. I just wish they spoke more English lol.", "Date": "2011-09-06", "AuthorLocation": ""},{"Author": "Amanda", "ReviewID": "UK8yP53RA9hEvsdmb0dkWg", "Overall": "2", "Content": "Not impressed. Like other Roberto's the cheese doesn't come with the Shrimp burrito. I find that odd because that's the way its supposed to be made. The location on Nellis and Stewart stays true to the original menu and they don't argue.  The second time at this place was just 5 days ago. Ordered 2 sausage breakfast burritos. The burritos were not good. They were filled with deep fried potatoes ( dry) and deep fried sausage ( dry), a little cheese, and next to zero eggs. They were wrapped crappy and then wrapped in paper so sloppy that they fell out in the bag. All the ingredients are supposed to be cooked on the grill with the egg to sausage and potato mixture is supposed to be 2-1. The whole thing was dry and hard to choke down.  Honestly, in the whole Vegas valley, only the Roberto's at Nellis & Stewart gets every item cooked correctly and tastes amazing. Other locales are going to have to step it up. Very disappointing I have to drive 20 mins for good Mexican fast food.", "Date": "2015-12-21", "AuthorLocation": ""},{"Author": "Miriam", "ReviewID": "qL9WgqFBnje8EKSM1LnMEw", "Overall": "1", "Content": "Unless you speak Spanish do not bother all the people who work at this company are rude.  I went to the Roberto's on Losee and had a really rude server when I complained I received a phone call from a person at this location who asked me to bring in my receipt and she would replace my order as they have had problems with this girl before.  I went and was told nobody new anything about this and basically I was looking for free food.  I will never go there again and I suggest you don't bother", "Date": "2014-07-08", "AuthorLocation": ""},{"Author": "Meagan", "ReviewID": "2RhzmnAD6TajGmWx92kUpA", "Overall": "4", "Content": "Love this location. We literally live across the street and it's our go to stop after a few drinks. The staff is always super friendly and the salsa bar is clean and fresh even at like 3 am. Fast service and food always tastes good, I'm from Tucson and I appreciate Mexican food done quickly that still tastes great.", "Date": "2016-02-01", "AuthorLocation": ""},{"Author": "Sasha", "ReviewID": "G1PDWPF7GcsYXtoG9Axzrg", "Overall": "5", "Content": "You can't beat a 24hrs spot that had carne asada fries! I prefer this location to several other Roberto's (Losee & Craig) because they are very consistent", "Date": "2015-05-22", "AuthorLocation": ""},{"Author": "Francis", "ReviewID": "JufZ6NkGlURlNi_iP2Vc5Q", "Overall": "4", "Content": "Service here is alright. I love their carne asada fries or California burrito. Food doesn't take that long too make depending how busy they are. They have lots of variety of Mexican style food. Prices are decent and they are open 24 hours a day. I always have a good portion of food every time I order and it's worth every buck. It is also clean here and offer fresh side bars.", "Date": "2016-10-08", "AuthorLocation": ""},{"Author": "Rich", "ReviewID": "TgAWcod-FIDRE6h5lAtYxQ", "Overall": "4", "Content": "I've been to different Roberto's all over town, and this one is always on top of their   food. Friendly staff, clean building, and great food as always! This place is on top of the way the food is presented and cooked, always very filling and tastes better than the other places in my opinion.", "Date": "2012-01-14", "AuthorLocation": ""},{"Author": "Lawrence", "ReviewID": "TbRBrDjIeqwyuDowiAEkNQ", "Overall": "5", "Content": "Only place I got for carne asada nachos!", "Date": "2012-12-20", "AuthorLocation": ""},{"Author": "Roger", "ReviewID": "JnShMW1vgj7QHX1bsHSsOw", "Overall": "5", "Content": "For about 7 bucks you can share carne asada fries because they give you a pretty nice sized portion! Plus you can't beat the 24/7 business hours for that late night, 2 in the morning munchies attack!", "Date": "2011-09-27", "AuthorLocation": ""},{"Author": "D.", "ReviewID": "kzPydXMaARJAzdLNEa_2XQ", "Overall": "5", "Content": "Man oh man oh man!  This place is good!  Open 24 hours!  The food really tastes like socal San Diego.  I ordered a number 11 (3 rolled tacos with rice and beans) and it was delicious!  I tried the green and red salsa and both were bomb!  Granny ordered a machaca burrito.  She said it was better than the normal place she goes to as they use tiny little strips of meat but Robertos meat was way better.  She saved me a lil piece and it was good.  Sis got carne asada burrito and i didn't hear any complaints so it must've been good! Definitely coming here again when I'm in the area!", "Date": "2013-11-18", "AuthorLocation": ""},{"Author": "Oceandria", "ReviewID": "8fmhBbg_EZI7dyJ0up9vsQ", "Overall": "4", "Content": "yum!  I've had the Carne asada tacos and the carne asada burrito.  Plenty of meat.", "Date": "2010-09-19", "AuthorLocation": ""},{"Author": "Karla", "ReviewID": "HglgW77irim4QCoFhXOTLQ", "Overall": "3", "Content": "OKAY so im not a big fan of this place,but everything else is soo far from me. I will say though I do enjoy the carne asada fries hold the pico. I also love grabbing some cucumbers and radishes mix in some lime and salt and BAM awesome snack!", "Date": "2014-06-26", "AuthorLocation": ""},{"Author": "Yvonne", "ReviewID": "k4MyMcgkcZ_vyDr3vethHQ", "Overall": "5", "Content": "This is one of the better Robertos in town....so glad it is here!! yeah!!", "Date": "2011-09-21", "AuthorLocation": ""},{"Author": "Stacy", "ReviewID": "Ebl4Dq6MWKoE8_zRLPepEA", "Overall": "1", "Content": "Ew ew ew! Why did I try this place again?! I had a friend rave over their chicken tacos so we went on Wednesday when they are a dollar. They weren't even worth that! Horrible. No taste at all and the tortilla was inedible. It wasn't soft but wasn't crispy. Every time I think I'm going to like Robertos, I am proven wrong. I won't be eating there again.", "Date": "2015-05-28", "AuthorLocation": ""},{"Author": "Ray", "ReviewID": "sCk-T9Rb0CkhB8K-D42rVQ", "Overall": "1", "Content": "This place it's really bad. I went there today for the first time and I will never go back. Food was not cocked properly and the person at the front was not even friendly. I will defenetly go back to the one I go all week. Management really need to check their food quality. C yaaaaa never again.", "Date": "2013-10-08", "AuthorLocation": ""},{"Author": "Michael", "ReviewID": "sHGI_ScPbKJD5djXSjdCQw", "Overall": "1", "Content": "I have been going to Robertos since it started at this location. I was excellent until the last couple of months. They have screwed up my last three orders. I looked at my receipt when I get home, but they can't fill it according to what I ordered. I also order chicken tamales and they were so old I had to throw them out. Now tonight I ordered cheese enchiladas and got chicken. Then I ordered chicken taco they are alway great this was uneatable.  Someone better look at management of this store very hard, because this is unacceptable  to our community.  We love this store, but Taco Bell is right next door. It isn't equal but at least it is eatable.", "Date": "2016-09-04", "AuthorLocation": ""},{"Author": "Rebecca", "ReviewID": "GPKAdMvoaX-UnXKP4oz9mQ", "Overall": "2", "Content": "We ordered 3 pork tacos and a quesadilla. Both lacking in flavor. The pork was to the point of overlooked and the quesadilla both had seriously no flavor, on the dryer side. I tried with and without the salsa..sauce the best one just overpowered the lack of flavor with heat, even the tomatoes were bland. My husband says if your starving and broke they are fine.... sorely disappointed. I hear rave reviews about Robertos... limes didn't even help.", "Date": "2016-10-28", "AuthorLocation": ""},{"Author": "Chelsea", "ReviewID": "aSEeVMsrokjiGwtW_OZugg", "Overall": "3", "Content": "This is my favorite Roberto's location by far. The service here is pretty good, and the shop itself is always very clean. It's definitely not my favorite  Mexican  choice, but it works if you're looking for quick takeout and of course, 24 hour service. I love the bar where you can grab as much spicy pickled jalapeno/carrot/onion mix and cucumbers with salsa as you wish. The burritos are huge, and extra spicy if you prefer. My fav is the shrimp burrito, stuffed with large shrimp and tons of onions/peppers. The tortillas are delicious. A popular item is the carne asada fries ... worth a try.", "Date": "2014-05-28", "AuthorLocation": ""},{"Author": "Robert", "ReviewID": "DxA2AoOamHijUtEzf_J3bA", "Overall": "4", "Content": "The usual Roberto's Taco Shop fare; however, this being a rather new Roberto's, it still retains it's fresh and clean looks.  I always either get the three rolled tacos (Taquitos) or a Carne Asada burrito depending on how hungry I am. They definitely get it right, but in a town full of Roberto's, it's hard to get it wrong when they set the standard.  Service is always prompt with someone always on the register/cleaning the salsa bar, and at least two cooks in the kitchen.", "Date": "2010-02-17", "AuthorLocation": ""},{"Author": "Miyone", "ReviewID": "NnxC1_f0Z-VrPVhcW6N80Q", "Overall": "4", "Content": "Unlike the other Robertos in the city this Robertos is consistently good.   Good things to order ; Chicken quesadilla  Carne Asada quesadilla Carne Asada fries Chicken tacos  Breakfast burritos  None of the above has ever failed me", "Date": "2015-05-03", "AuthorLocation": ""},{"Author": "Darren", "ReviewID": "v0rszLEq4YglpcPs-D6ueA", "Overall": "3", "Content": "It's Roberto's . seemed slow and they made my oder to go like they didnt want any dine ins", "Date": "2013-08-09", "AuthorLocation": ""},{"Author": "Scott", "ReviewID": "FvV8NI_dPIQdC86_Metsew", "Overall": "1", "Content": "Wasn't going to say anything until girl swept dirt on me.  Girl sweeping rug towards me and I can feel dirt hitting my legs, wow!  Wtf?  Seriously!  Get a vacuum.  Whole restaurant was dirty and disgusting.  Sink in men's room faucet handle broken.  Restroom also dirty and disgusting. Then over charge me for my burrito, asked for no cheese but she charges me for it anyway.  I'll never come back to this one.", "Date": "2016-08-09", "AuthorLocation": ""},{"Author": "Christopher", "ReviewID": "cpSd_DikrqRwMdiJxMLJQA", "Overall": "4", "Content": "I love Roberto's when I am drunk. I hope all of you get to experience awesome tasting cheap mexican food at 4 am after a night of partying cause it's amazing. I recommend anything with  carne asada  in front of it!", "Date": "2013-03-14", "AuthorLocation": ""},{"Author": "James", "ReviewID": "mmfeYWIlQjiuc-6Bw-fJPQ", "Overall": "1", "Content": "I will say the food was good until the service ruined it on me.  The lady behind the counter was being relatively rude, and when I got my plate, it had a short blond hair among the cheese.  She refused to replace it stating it was mine.  I have brown hair, inexcusable.", "Date": "2014-05-06", "AuthorLocation": ""},{"Author": "Sarah", "ReviewID": "Wzn2PHG-k4HRmr_c7vJ49w", "Overall": "3", "Content": "Food is decent but customer service from the girl that works the cashier is horrible. Everytime I go in there she is rude and looks pissed off. I noticed a difference in how she greets and interacts with others depending on race and/or gender. She charged me a fee to swipe my debit card also which I don't ever remember having to do before. Though its probably the cleanliness out of all locations, I try to avoid coming to this location solely because of service.", "Date": "2015-12-21", "AuthorLocation": ""},{"Author": "Andrea", "ReviewID": "OdxK_UPAOJFDHMypqsHlHw", "Overall": "5", "Content": "Roberto's is bomb! This location is great, they are fast and the food always tastes great. Would recommend!", "Date": "2014-05-31", "AuthorLocation": ""},{"Author": "Olgi", "ReviewID": "7cK4kQWYHnXPLfT60rde-A", "Overall": "1", "Content": "Stay away!!!! The girl was rude as all hell. I asked for 3 tacos de res (beef) 2 tacos de pollo (chicken) a burrito carnitas 2 orders of chip and 2 guacamoles 1 carne asada burrito. Upon paying $40.00 I reviewed the order and questioned the tacos. I said excuse me I ordered tacos de res not asada. She very rudely answered you asked for beef I said yes not asada she said beef is asada I asked do you have shredded? She said yes but you asked for beef going back and forth a few times I said give me shredded period. She rolled her eyes said something to the cook he answered yeah well I have all day in Spanish. First time there and for sure the last time. What a shame. The food is not all that either maybe her attitude jacked it up for me. Mr Roberto time for a change in staff. The loosee location BITES", "Date": "2014-09-24", "AuthorLocation": ""},{"Author": "C.", "ReviewID": "c_YE8NXIejYDzrye8J6WBA", "Overall": "4", "Content": "A solid 4 stars.  See my tip also posted below.  Chicken chimi, enchilada style - 4 1/2 stars...full of chicken, crispy, tasty.  Oh, and be warned, it is BIG!  I had to ask for the shredded lettuce though.  Beans - the refried beans were pretty good.  A bit salty though.  Rice - see beans comment.  I really liked the chimi.  Best I've had since I lived in Tucson.  I'll be back to try other items.", "Date": "2013-12-15", "AuthorLocation": ""},{"Author": "Celina", "ReviewID": "WJVOT073DX4jkQJcMyU4bA", "Overall": "3", "Content": "Food was good, but HORRIBLE service. We walked in and nobody was at the counter or even in the kitchen. We waited 5 minutes until this lady came from the back on her phone texting and didn't even say a word until we started our order.", "Date": "2015-04-23", "AuthorLocation": ""},{"Author": "Jeff", "ReviewID": "xBBzeHBWDwoC0pg0rlxG1g", "Overall": "5", "Content": "The cleanest/best Robertos in town", "Date": "2011-06-01", "AuthorLocation": ""},{"Author": "Chris", "ReviewID": "FvIF_Qz1_kl9MwIBI-pSjQ", "Overall": "4", "Content": "Excellent food! Had the chimi. It was delicious. I definitely recommend this as a  must try . Cheap and filling!", "Date": "2014-06-20", "AuthorLocation": ""},{"Author": "Joelle", "ReviewID": "7UC-cXCTKgLaMZBYBC8-lQ", "Overall": "4", "Content": "Coming from San Diego, where taco shops extend beyond the Roberto's chain, I found myself hopping from taco shop to taco shop after moving to Vegas, chasing the guacamole dragon.  I finally found this location, which has a friendly staff, is clean and reminds me most of the taco shops back home. Everything I've had here has been good and the price is reasonable.  I personally love the #11 -- 3 rolled tacos with rice and beans. On occasion, the beans can get kinda salty. Someone back there gets a little heavy handed with the cotija cheese (salty salty!), but I just throw more hot sauce on it and move on.  Two negatives: Their horchata isn't very cold. That may be traditional -- maybe I'm just a gringa used to icy cold horchata, but its not even served with ice. On one hand, I dig it because you get more horchata, on the other hand... it's warm horchata.  The other is that they don't offer chips and salsa.  Every single Roberto's I've been in, when i ask if we can get an order of chips and salsa with our to-go, has given me a look like,  Que?   And then we end up with a stryofoam carton full of chips and pico de gallo.  The concepts seems to elude them. Maybe it's a SoCal thing.  But I drive out of my way to go to this location. Good stuff.", "Date": "2011-08-01", "AuthorLocation": ""},{"Author": "Michael", "ReviewID": "KXQTHLzfWLSbWCw0ckusNA", "Overall": "2", "Content": "The food quality & customer service has been pretty poor at this location. I was surprised at how items such as a simple taco or a burrito missed the mark.  The staff at the North Las Vegas location tend to be a tad rude at times (Especially this 30 something mexican woman, whose attitude stinks!). She rolls her eyes when I order food & seems very disinterested in the job. One of the cooks also seems easily irritated when customers have simple requests (such as not adding guacamole to the tacos, etc).   I visited this place with my friend after a night out in Vegas, and altho the food hit the spot...the customer service left much to be desired.   Would I recommend this place? Not really...I'd head to  Don Tortaco  off Craig & Camino Al Norte if I wanted a friendlier place with consistently better food quality. The staff there are nicer and greet you in a very natural way...especially if you are a familiar face :)  2 out of 5 stars for Roberto's Taco Shop. I docked 3 stars for the poor customer service, attitude and inconsistant food quality....things that easily take away from a pleasant dining experience.", "Date": "2013-02-09", "AuthorLocation": ""},{"Author": "Geddi", "ReviewID": "gVZpp7Yw_x87oX0lRl_bCA", "Overall": "4", "Content": "this place is always yummy! i havent had an issue yet! the service is pretty good, and the food is always amazing! they have daily specials so your never spending too much money :)", "Date": "2011-08-05", "AuthorLocation": ""},{"Author": "Karen", "ReviewID": "PV_x63_t1oHCZcwsSBTxZQ", "Overall": "1", "Content": "I occasionally been here in this location. I had bad service all the time. The servers are always in a mad mood and always rude. I really dislike the service at this location. Don't recommend this location.", "Date": "2014-11-20", "AuthorLocation": ""},{"Author": "John", "ReviewID": "mgfwtwcGK9tBi43NcEZqfw", "Overall": "3", "Content": "So I think it's pretty shitty that they charge you to use your visa, and not very friendly.", "Date": "2016-04-28", "AuthorLocation": ""},{"Author": "River", "ReviewID": "Z_g5EBn0IgY19FrV9X1caw", "Overall": "3", "Content": "$2.99 bacon breakfast burritos on Tuesday!!  Although I think I prefer the Don Tor Taco on Craig to this Roberto's location, I've never driven the extra couple miles to go to that one so I guess that says something. When it comes to Roberto's, we don't deviate from our usuals very often: carne asada nachos, breakfast burritos, or the beef chimichangas.   One thing that I feel I should note; the salsas are consistent, but only to that particular location. Don't expect to get the thick salsas that are served here at a location across town.   I knock off a star for the $.50 charge to use to charge card.", "Date": "2013-05-06", "AuthorLocation": ""},{"Author": "Malcomn", "ReviewID": "ZplCwr-dAx7KVk9Ibf6Vjg", "Overall": "1", "Content": "Never eating here again. I found a nail in my order of Carne Asada Fries. Worst experience ever.", "Date": "2016-07-31", "AuthorLocation": ""},{"Author": "Brittany", "ReviewID": "2ws89t1hEXVOYyvizpXXjA", "Overall": "5", "Content": "I swear to everything that I love that this place makes the perfect carne asada fries. Not sure if I spelled that right but honestly I've been to so many different Robertos and every single one of them is not as good as the fries in this Roberto's. So I go here all the time and I'm just in love.", "Date": "2016-05-11", "AuthorLocation": ""},{"Author": "Dennis", "ReviewID": "Bzv6VuV2g37kyn0rjGCGTA", "Overall": "3", "Content": "On this latest occasion I had a massive Wet Bean & Cheese Burrito smothered with Cheddar Cheese and overpowering Enchilada Sauce, along with a Shredded Beef Taco with tomatoes and guacamole.  Unfortunately, little guacamole was added to the taco, and it was of the creamy sour cream variety.  An excellent pliable fried corn tortilla was utilized in the preparation of the taco.  And, the Refritos were hot and smooth inside the nice flour tortilla casing of the burrito.  As always at a Roberto's Taco Shop, hot carrots and peppers and two types of hot sauce were on hand.  Paper napkins are tightly controlled here, even though a need often exists for multiple numbers of them.    Overall, a solid taco shop, with 3-1/2 stars earned on this particular visit.", "Date": "2013-09-03", "AuthorLocation": ""},{"Author": "Aaron", "ReviewID": "4Bz8gH5bxPQL-DsmXu8f_w", "Overall": "5", "Content": "Adobada burrito / taco! It's what I do and all I eat ;) although the rolled chicken tacos are also scrumptious! So many locations it's def a good filling meal! And to top it off 24/7 just about anywhere in the valley! My favorite Mexican fast food shop all the way!", "Date": "2015-07-27", "AuthorLocation": ""},{"Author": "Billie", "ReviewID": "XI-Y5jgy9ZM0RQUHQwvsOg", "Overall": "1", "Content": "So.. We come to this Robertos at least once a week and the food is always good just like all the other Robertos, although I prefer the location on craig this is closer to my house.  Tonight they packed up my 3 rolled tacos w/ sourcream and cheese (which i havent even orderd sour cream on them but they charged it anyway) upside down in a paperbag so when they arrived at home it looked like someone had puked in the box. Also ive gotten a bean and cheese burrito and there was barely anything on there. I couldnt eat the tacos because it looked just to nasty. So for me i will never return to this location i'll drive the extra mile to another location and so should you!", "Date": "2012-01-11", "AuthorLocation": ""},{"Author": "Michelle", "ReviewID": "rodSuq5zMaq_OXV-XT4K4g", "Overall": "5", "Content": "Best breakfast burritos in vegas well maybe anywhere I have ever been!! I love the salsa bar green salsa as well as the spicy carrotts and peppers, fresh cut cucumbers... I love this place and its right down the street from me I could walk there :)", "Date": "2011-06-30", "AuthorLocation": ""},{"Author": "Max", "ReviewID": "1urGg1NT8ifIUPcCd_-lrA", "Overall": "5", "Content": "This review Is for the location on Centennial. I won't bore you about how  I'm from California and thus and expert about Mexican food.  As Roberto's and dang near every Mexican restauranteur is either from California or Mexico.  I usually pick up a burrito on Thursdays because that's my busy day at work and it's convenient to grab food from Roberto's on my way to work and it sticks with me all day even if I don't get a lunch. I'm thankful they are opened 24 hours as I can order whatever I want; breakfast or lunch.  The food tastes authentic, hot and ...fresh?? Or shall I say not as greasy as other locations. Some locations are heavy on the salt but the cooks here make their food well. The restaurant is always clean. On my last visit, the cashier came from outside after sweeping. He washed his hands upon entering the kitchen and taking my order. This stood out to me because I work in healthcare and am mindful of such behaviors.  The cook came out and struck up a conversation with me in broken English. I couldn't really understand him but I appreciated the customer service enough to take the time to write this review.", "Date": "2013-11-16", "AuthorLocation": ""},{"Author": "Lavi", "ReviewID": "F_fCmpyH27OhwW_WHGHoVg", "Overall": "4", "Content": "This Roberto's has the Same Menu Items as the Rest of them in the Las Vegas Valley! Same Furnishings as The Others as well! I had No Problems with My Order...They were Pretty Quick with My Order.   They do have a lot of Parking, as they are sharing with other Businesses in that little Strip Mall! They are Open 24 Hours, and I think this location is a Fairly New One!  Just be Wary of some of the Drivers in the area, at times they don't look when they are Backing out of the Parking Stall, or Keep on Driving when they were Suppose to Stop at the Stop Sign!", "Date": "2016-01-23", "AuthorLocation": ""},{"Author": "Terry", "ReviewID": "hJ27f4RCQXiswIr1GOjiHg", "Overall": "5", "Content": "Great food, cheap, hangover food, can't really complain, lived their shrimp burrito, chimichanga is also amazing.", "Date": "2014-02-05", "AuthorLocation": ""},{"Author": "Tess", "ReviewID": "YlD2KyEtl6CkpR5ujTlv8A", "Overall": "1", "Content": "Went to the location on Craig and Nellis. It was really early - 4 or 5 am.  I was sick for 2 days afterwards. Can't recommend it. Also, they don't appear to use any salt during food prep because the food has no flavor. It has taken me weeks to write this review but I still want my money back!  If you are going to visit a Roberto's, the shop at Boulder and Russell is always clean - guessing no one gets sick from poor food prep/employee hygiene there.", "Date": "2013-12-14", "AuthorLocation": ""},{"Author": "Shannon", "ReviewID": "sCcDFZrcGkqOtRfcpLSvrg", "Overall": "5", "Content": "Best Robertos I've ever been to in Las Vegas. Very clean, cool retro look, nice staff who actually speaks and understands English very fluently. Other Robertos I've been too in Vegas was dirty, building looked rundown and old, and the people who worked their could barely even speak English. I am not being racist or want to be perceived as being a racist but I am just stating facts.  Anyways, the food is always great and on point at this location. I visit this Robertos about 3-4 times a week to grab breakfast or dinner. The bacon, eggs, and potatoes breakfast burritos are amazing and very filling. And they're all under $5 for 1/2 lb chunk burrito.   For dinner you can't go wrong with the Carne Asda fries or anchors or the rolled toquitos. Your choice of beef or chicken. Condiments such as cucumbers, limes, and sauces are always fresh and the area is always clean unlike other Robertos in this town.  Some of the specials they have to offer is wet bean and cheese burrito Mondays for $3.99, Chicken burrito Tuesdays for $3.99 (Mon. & Tues. offers come with a drink and a side of beans and rice), and 99 cent taco Wednesdays.  I don't have any complaints.", "Date": "2011-10-25", "AuthorLocation": ""}]}