{"RestaurantInfo": { "RestaurantID": "_5YnAQRM1fJjKP8IenNKEA", "Name": "STARBUCKS", "Address": "2295 N GREEN VALLEY PKWY", "City": "HENDERSON", "State": "NV", "Zip": "89014", "Longitude": "-115.0844471", "Latitude": "36.0561772"}, "Reviews": [{"Author": "Kendall", "ReviewID": "LlIPTUztVpf-sZzToQ3hQA", "Overall": "3", "Content": "Stopped by here on our way to get our eyebrows threaded next door.  Usually I won't stop by a Starbucks unless they have a drive through because its simply more convenient, but this place was literally right next door so we decided to take our chances. It's a quaint little location with few seating options but it gets the job done.  I ordered a Vente Sparkling Passion Tea Lemonade Sweetened with light ice.  I got a Vente Sparkling Passion Tea Un-sweetened with heavy ice.  In their defense I didn't say anything or return it because I don't like to send stuff back and be  that  customer.  I did like the staff at this location though!", "Date": "2016-03-24", "AuthorLocation": ""},{"Author": "Erika", "ReviewID": "l7zK7HjqC2F49pLBRAvKxw", "Overall": "5", "Content": "I LOVE how people keep going to places they don't like very much lol I've never had a problem here. I do know how to drive so the parking lot isn't an issue for me. Great service and I always feel welcome", "Date": "2014-02-21", "AuthorLocation": ""},{"Author": "Anthony", "ReviewID": "LthCB7wWJ7jyNLhnYnqm2w", "Overall": "5", "Content": "Love the convenience of this neighborhood coffee shop.  I hope it stays here as an anchor tenant for the shopping center for the indefinite future.", "Date": "2014-11-15", "AuthorLocation": ""},{"Author": "Jennifer", "ReviewID": "CHCfskq8mzXpPIGGpKkt1A", "Overall": "5", "Content": "It was great. Starbucks has brought me back to them a few months ago. Great crews, awesome coffee, and quick, quality service. Doesn't matter which one I e gone to lately, I'm always happy!", "Date": "2017-01-18", "AuthorLocation": ""},{"Author": "Marty", "ReviewID": "LT6TNWKSmDSX4ZaMO-DQcg", "Overall": "4", "Content": "This is like any other Starbucks, so nothing major to report; but the fact that it's an out of town location.  I checked in on Four Square and noticed that the tip read that the people who worked here were horrible and snobby or something like that.  I saw two girls working there and I can kind of see how one of them could be seen that way, but she was nice to me.  Ordered our drinks and out the door we were.  Went there twice in a weekend and both times were pleasant.", "Date": "2011-04-21", "AuthorLocation": ""},{"Author": "Lex", "ReviewID": "h82ZLdCUsS2eFQrNFpBFpA", "Overall": "2", "Content": "It's just a two star day here at Starbucks. This is my neighborhood one and it's in a slump in my opinion. When we came in the person in front of us ordered a smoothie but they were out of banana. The barista making smoothies really took it personally apparently because she threw the blender pitcher into the sink and then was really snippy with the customer about making something else. I was next customer up and my drink is definitely wrong but there is no way I'd say anything based on how the last person was talked to.  Overall, there is an A team here and when they're working it's great. When it's not the employees that actually want to be here.... Save your money.", "Date": "2015-03-22", "AuthorLocation": ""},{"Author": "LUCY", "ReviewID": "70MjX1UyONo3qn0fFJEiCA", "Overall": "3", "Content": "The usual Starbucks experience except no drive thru.  Great frappuccino!  The tables were really close together and seemed a little claustrophobic in there.", "Date": "2015-10-23", "AuthorLocation": ""},{"Author": "Ginnie", "ReviewID": "bjjhonx2vOGuhm1lKzH6aA", "Overall": "1", "Content": "Walked in to this quite Starbucks and stood at the counter for 5 minutes before either employee acknowledged me. Well NOT be going back to this location!", "Date": "2015-01-08", "AuthorLocation": ""},{"Author": "Jessie", "ReviewID": "yu85dS1NZw2G5muf-LUcZw", "Overall": "2", "Content": "Color me unimpressed. I wanted Starbucks before work and decided to stop at a location I had never been to. No drive-thru, so I had to go inside to place my order.   The workers weren't the chipper, friendly, polite baristas I come to expect when I am paying $5 for a cup of coffee.   I won't be back.", "Date": "2011-01-06", "AuthorLocation": ""},{"Author": "Sir-Elton", "ReviewID": "4YkMkD1L9XP6RxovP5fohg", "Overall": "2", "Content": "Bunch of donkeys at this location. Asked for a white hot chocolate and a breakfast sandwich (double smoked bacon, egg and cheese on a croissant). I received a white mocha and a breakfast sandwich (egg and cheese on a wheat English muffin). How do you royally mess up BOTH orders!!! First of all, what tasteless human being enjoys only egg and cheese on a breakfast sandwich - how do you not want meat? Then a whole wheat English muffin to top off this tasteless item. Just wrong. For the white mocha mess up, I have NEVER had coffee in my life, I've never even used the word MOCHA in my life, so how he mis heard my order, still confuses me. Whatever, I threw both items away cause the line was too long to wait again and I hate being that person who complains to management.", "Date": "2015-12-26", "AuthorLocation": ""}]}