{"RestaurantInfo": { "RestaurantID": "_6UaHEnDDbUla3Pa3VVu3Q", "Name": "ASIA CREAMERY", "Address": "7460 S RAINBOW BLVD, STE 110", "City": "LAS VEGAS", "State": "NV", "Zip": "89139", "Longitude": "-115.2429919", "Latitude": "36.053499"}, "Reviews": [{"Author": "Elena", "ReviewID": "PJfUoRw4afp7fr7qOheK0w", "Overall": "5", "Content": "Delicious ice cream and lovely people! They offer soft serve, homemade ice cream and shakes. Would recommend the homemade ice cream, they have such unique flavors (especially Filipino flavors-the halo halo is super good!!) They also sell novelties such as cakes, ice cream sandwiches, and premade cones if you're on the go.", "Date": "2016-12-30", "AuthorLocation": ""},{"Author": "Canny", "ReviewID": "tjvtp4J_Vp4QPUc_YL5tFQ", "Overall": "2", "Content": "I've been eyeing this shop for a while now and finally found someone to go/take me there. Living on uber/lyft for 3 weeks sucks a huge chunk of my food expenses.   So they promote the buy 1 get 1 free on Thursday but it's only for their soft serve! Don't be fooled like me!   I sample so many flavors but none of them stood out to me. My go to coffee flavor, as well as the lychee, was extremely dilute. I never had such bland coffee and lychee flavored ice cream before. The avocado and queso flavors were strange and the jack fruit flavor was too sweet. I eventually settled with the ube and banana crunch because I felt obligated to purchase something. I was far from satisfied with the ice cream.   Great customer service. They don't judge you for sampling a lot.", "Date": "2017-01-02", "AuthorLocation": ""},{"Author": "Julius", "ReviewID": "N4AM6DykuzX6nJRakuSSNQ", "Overall": "5", "Content": "Delicious way to start this sunny day. I am new to town So they were very nice to let me try a couple of flavors before getting the one I wanted.I got the Ube smoothie with pearls, very yummy. This place has many varieties of ice cream, cakes, and cookies ice cream! . I definitely recommend.", "Date": "2016-12-30", "AuthorLocation": ""}]}