{"RestaurantInfo": { "RestaurantID": "_8VkSb_Mryb6bHQxSWB7Pg", "Name": "SWISH SHABU SHABU", "Address": "5115 W SPRING MOUNTAIN RD, STE 121", "City": "LAS VEGAS", "State": "NV", "Zip": "89146", "Longitude": "-115.211285", "Latitude": "36.1261008"}, "Reviews": [{"Author": "T", "ReviewID": "a57KutEr58hGyYPnXX2TvQ", "Overall": "2", "Content": ":( I regret coming in here. The meat n seafood wasn't fresh. It was such a small portion for the price. The ambiance was dark n blah! The service was decent though. I don't think i'd b back :(.", "Date": "2012-02-09", "AuthorLocation": ""},{"Author": "Roger", "ReviewID": "7Yao5q2BliOKyXZJ69RIVg", "Overall": "5", "Content": "Finally I am able to try a shabu shabu place. I would always hear my siblings talking about it and glad I can finally say  I tried it!   The experience is similar to kbbq style but you are cooking your meat in a hot pot style. You can order between different varieties of meat and veggies. After that you can choose which flavor broth you would like and they'll bring the flavor broth in a pot and a mini burner. We orders the seaweed, miso and spicy miso broth flavors. The seaweed broth was a little bland, I enjoyed the miso and spicy miso a lot more!   You then cook raw thin slices of meet in the broth until it's cooked. The same rule applies for the vegetables and udon noodles. You can either eat them with a bowl or rice or even make your own little soup bowl to slurp from. Overall I had a great experience and would recommend this place. Especially if your feeling cold, it'll definitely warm you up!    Taste it, Love it, Yelp it! ", "Date": "2016-02-26", "AuthorLocation": ""},{"Author": "Matthew", "ReviewID": "MjuuT_sbkFZvTBqVV_fOQg", "Overall": "4", "Content": "BAM!!! That was  some gooooood eatin.  10-15 minutes off the strip but so worth it. The spicy miso broth was so tasty especially after cooking the meat and the veggies. For $20 you get a large portion of prime rib eye and veggies. So worth it.", "Date": "2011-12-28", "AuthorLocation": ""},{"Author": "Caz", "ReviewID": "IhIbsMIyPnRzjTQBrgVZ6g", "Overall": "4", "Content": "Friendly service and yummy food. Plus it's fun! (and it helps when you have a groupon)  Swish was tasty. The staff was friendly, mixing and pouring our broths for us. Me and my fiance both ordered the sukiyaki. We went in for the lunch specials. I ordered the seafood and he ordered the kobe chuck. The way the veggies and the noodles soak up the salty, sweet flavor of the broth was amazing. You also get a bowl of rice so you definitely are full when you leave.   The prices are a little high for an average lunch. For a cup of sake, one lunch kobe chuck, one lunch seafood combo, and one order of green tea ice cream, the total bill was $42. But we had a groupon for $30 so our bill was only $12. I'd definitely go again and bring friends.", "Date": "2011-08-03", "AuthorLocation": ""},{"Author": "Grace", "ReviewID": "JS8SBtnIEeGWC12Qk15nAA", "Overall": "2", "Content": "I've been here a couple times every time I go to Vegas. Service is horrible, goma sauce is way too sweet, and they take forever to bring you stuff you ask for.  They also mess up on our checks and overcharge us for things we did not order.  Go here if you are dying from a shabu crave but nothing less.  Very disappointing", "Date": "2011-12-28", "AuthorLocation": ""},{"Author": "LAN", "ReviewID": "SE8xIX87ZfaRPxQphrJNhg", "Overall": "1", "Content": "I should have seen the sign when no one in there when it's dinner time.  We went in and we got stuck.  Japanese Shabu Shabu was bland and no flavor.  Shushi was not fresh.  I am from LA, and this is horrible.  This place had 4 stars??????", "Date": "2013-08-09", "AuthorLocation": ""},{"Author": "Lacy", "ReviewID": "_xb5BRuIek1WifFB4f1CPQ", "Overall": "1", "Content": "Dinner was amazing until I found a long black hair. Spoke to the manager on the phone (no manager present) and he insisted that this has never happened before and offered no retribution to fix the situation. Plus appetizer came after the meal.   Normally, we eat at a different location. And we will never come back to this location again. Horrible customer service experience.", "Date": "2016-01-19", "AuthorLocation": ""},{"Author": "Mike", "ReviewID": "H51WDz_wjJvhnLh4Rdak3w", "Overall": "5", "Content": "I really like this place. I travel a lot see a lot of different styles and types of restaurants and this one I would have to say is probably one of my favorites. The food was good you get to cook it yourself, if you like spicy the miso spicy broth is what I like definitely try the shabu shabu. The sushi roll great also..", "Date": "2012-03-04", "AuthorLocation": ""},{"Author": "Jin", "ReviewID": "tcNPQ1aDga-YpO22-tR4wA", "Overall": "5", "Content": "Saw groupon $18 for $30 worth of lunch and decided to try Swish out for the first time. We were a party of two and arrived at Swish around 11:30am.   It was very easy to find. When we entered the restaurant, they already had 3 other tables all eating shabu-shabu. We initially planned on ordering one Shabu (spicy miso) and one Sukiyaki so we could share. But after seeing everyone else eating Shabu, I had doubts about ordering Sukiyaki.   We were seated immediately. Our waiter was this asian gentleman who was super friendly and made us feel very comfortable using both groupon and yelp free sake coupon when asked.   I asked how sukiyaki was and he even offered to bring Shabu broth for our sukiyaki order if we end up not liking sukiyaki!!! Amazing service!!!  So we decided to go ahead and order 1) prime rib eye sukiyaki and 2) seafood party spicy miso Shabu as we planned initially along with  sassy calamari  as an appetizer. Sassy calamari is a must try. It is amazingly GOOD. Portion was kinda small but it had nice sweet and savory flavor with a kick. Thinking about it makes my mouth water Yummy yummy calamari!  Pots with broth were brought first with veggie plate. Tried both broth before adding any condiments and WOW sukiyaki broth was goooood. On the other hand, spicy miso was kinda bland.   My bf loved eating rib eye and udon noodles sukiyaki style. Spicy miso was just mediocre even after adding vegetable, meats and seafood so I had to modify it by adding some of the sukiyaki broth (extra sukiyaki broth is brought to you in a bottle from get go so you don't need to ask server for it). After adding sukiyaki broth and letting it simmer for a good 5-10 min, spicy miso Shabu became delicious!    We both really enjoyed our lunch and will definitely return again soon!! Thank you SWISH!", "Date": "2015-02-02", "AuthorLocation": ""},{"Author": "N", "ReviewID": "DlfjqVv-9DBrYrEMbAoXdQ", "Overall": "1", "Content": "The restaurant was quite slow for lunch time when we came in. There were only two other patrons. Now, I know why. The food was Very disappointing! The shabu and the rolls were not good. I will not return.", "Date": "2015-09-28", "AuthorLocation": ""},{"Author": "Paul", "ReviewID": "Dzg6QzakiDUmHCv9CNRiKA", "Overall": "4", "Content": "Swish, a shabu shabu place where you dip your meet in a broth to cook along with vegetables.  There's also sukiyaki, where you cook the meat in a more shallow pot of sauce/broth.  There's not much more to it.  They serve you raw vegetables and meat, and then you basically just cook it yourself in their broth.  It was delicious, but I think it's a bit over-priced for shabu shabu/sukiyaki.  However, I don't see any place like this around Vegas.  The place is small with a U-shaped counter.  I couldn't really talk with our group much.  The decor is clean with just one TV on one side of the room.  Guess where us guys sat.  On the side where you're able to watch the NBA game haha.  Not a bad place at all, just wish the prices were a bit better.", "Date": "2007-05-30", "AuthorLocation": ""},{"Author": "Monica", "ReviewID": "u3LorSQTWoa9IkLYf7fyEw", "Overall": "3", "Content": "Came here for lunch with a few friends and loved it!  It was a nice change of pace from the Las Vegas Strip Hotel foods.  They had a lunch special for $11.00 which included your choice of meat for shabu along with all the veggies.  i was happy to see that they included asparagus as one of there veggies and they had the most amazing dipping sauces!  If you are in the area definitely give it a try.  It's not that far off the strip and it wont break the bank.  Next time I plan on trying the sukiyaki, heard that was yummy too.   :)", "Date": "2010-08-24", "AuthorLocation": ""},{"Author": "A Pair", "ReviewID": "AScqR3-6_JknWZR2_FlUig", "Overall": "4", "Content": "After long day i got chicken sukiyaki It was really bomb and great service! Definitely will be back!!!", "Date": "2016-01-15", "AuthorLocation": ""},{"Author": "Connie", "ReviewID": "2BtwqjkRO2p6nlk5BlgD6A", "Overall": "2", "Content": "Mediocre at best. Went here on Mother's Day with my mom and sister. The restaurant is too dark and the atmosphere is dark and dingy. Walking in we were just given a hand gesture to  take a seat wherever you'd like.  The restaurant was not busy at all. There was someone who seemed like the manager and ONE server working. This seemed interesting as everyone knows it's one of those holidays people eat out.   Simply put the server did not explain the menu, seemed irritated at our questions, and was rushing us. When tables started to clear out a bit we still had to do the  I'm drowning  hands to get water refilled. Several tables were not bussed it was gross. The 2nd star is only for the quality of the food which was okay. The sauces were good. This still would never make up for the service. Don't eat here if you aren't familiar with Shabu Shabu, you won't be helped.", "Date": "2016-06-19", "AuthorLocation": ""},{"Author": "Kaori", "ReviewID": "yHQPmwdBcYiG3xtmCNKsag", "Overall": "2", "Content": "I came here eons ago when it first opened and still wonder about it's success. I really didn't like it. Shabu-Shabu is supposed to taste much better than this.", "Date": "2010-11-30", "AuthorLocation": ""},{"Author": "Suki", "ReviewID": "bY5oC47HgCD5pnxI9Id6Ig", "Overall": "5", "Content": "My family and I come here often for shabu shabu. It's tucked away in the same plaza of SF market and right underneath Bazic. The layout of the restaurant is somewhat off. All the tables are scattered everywhere, but it's nice to be able to sit at a 8-top table when it's only the three of us.   Service can be a hit or miss. The times we've been there, it's been a miss. The place was busy and attentiveness lacked so much that we got up to get our own condiments that we asked a few times for. Sometimes, even getting a menu could take a awhile. There was also a time when they forgot about our rice and I waved my hand in the air, but the staff that looked dead at me just didn't care. I was like damn he's faking the funk game is stuuurdy, real sturdy. It can get frustrating at times. When the service is a hit.. it's a wonderful experience here. Everything comes all at once, drinks are refilled, rice is given without being asked. So it's all about chance here.  We usually get the Kobe Chuck, hungry portion that comes with a small amount of sliced white onion, mushroom, tofu, cabbage, broccoli, green onion, and udon noodles. I love their dipping sauces which are a ponzu-based sauce for your veggies/noodles and the goma sesame-based sauce for your meat. I add the minced daikon, garlic, and green onion from the condiments selection to my ponzu sauce to intensify the flavor. I also add garlic and green onion to my goma sauce to give my meat the same effect. Delicious. If you don't get your white rice or condiments by the time your meat and veggies are done.. Ask for it!   I highly suggest to avoid the soy milk broth. There isn't any flavor whatsoever and it's so translucent that it's almost all seaweed broth with a sake shot of soy milk. I was looking for more of a heavy cream based broth as in all soy milk not half or a shot of. I stick with the Spicy Miso Broth, which has the most flavor from the three of Seaweed, Spicy Miso, and Soy Milk.   The technique for shabu shabu is to you its own. I prefer to use half my tofu/cabbage/mushroom/broccoli portion, all my white onion/green onion, and save the udon noodles at the very end. While the veggies are almost done, I swish one by one my Kobe Chuck slice, then dip it in the goma sauce and get a veggie.. dip it in my ponzu, then combine both (meat/veggie) with my white rice and there you have the magic of shabu shabu. Lastly, I save my udon noodles for the broth that had everything boiled in it. Think seasoning the broth for a soup ;)  Shabu shabu is soul food at its best. I always leave here with a smile on my face. It's therapeutic, yet fun at the same time. Love the music they play here. Top 90's, Reggae, and some old school like Sinatra got me movin' while I'm swishing away. Keith Sweat - I'll Give All My Love To You... Ready For The World - Love You Down just to name a few. Dining here with music that I love is a plusplusplus!  Winter, Spring, Summer, Fall.. I can always go for Shabu Shabu whenever. That's how much I love it. It's one of my favorite cuisine! And Swish is our Family's favorite place for it.", "Date": "2015-07-05", "AuthorLocation": ""},{"Author": "Benjamin", "ReviewID": "dcIYxH1pQK7tPiL8TlPmFw", "Overall": "4", "Content": "I got the sukiyaki broth with chicken. The chicken was great but I would have liked more than 4 or 5 noodles with the sides. The camp stove that was used in the table was uneven and kept wobbling, but it wasn't a huge problem.", "Date": "2016-08-15", "AuthorLocation": ""},{"Author": "ie", "ReviewID": "lICSZ6FwUwkjs-3piatt5w", "Overall": "1", "Content": "What happened to this place? It used to be so good. I opted for the Prime Chuck, and it was so thick, tough and chewy. Their beef used to be really good.  Service was not great. Never checked up on me, as I didn't have enough water to finish cooking my beef.   Sadly disappointed.", "Date": "2013-07-11", "AuthorLocation": ""},{"Author": "Syam", "ReviewID": "Jd-EmF8Mezzv5zu1o8wbqw", "Overall": "1", "Content": "Food is not so good an service is very slow.  Not properly staffed .Ask for plates for the table of 6  an they bring you one   Visiting Vagas as well an thought this was a good idea. I won't be back", "Date": "2015-06-07", "AuthorLocation": ""},{"Author": "Joey", "ReviewID": "ijFU2l4lCzQpyGLfklWMWQ", "Overall": "5", "Content": "Oh Goodness! This has to be my all time favorite restaurant!  The staff is super friendly, attentive and nice!! How many restaurants workers these days remember their customer's by name and talk to them outside of work? Not many, but they do! And it's not because I go every week. Truthfully, with my schedule, I can only get there once every 3 to 4 months, but my friends, family and I look forward to it every time! The food portions are GREAT for the price.  I noticed one person complained that they didn't get enough food for the price, but I think that is due to American portion sizing expectations. lol, compared to the rest of the world, we over-stuff ourselves.   **The food~ I have tried everything there from t he Kobe Chuck, Kobe Ribeye, to the seafood platter and chicken platter. My Good Old reliable favorite is the Prime Rib Eye, Healthy size, Sukiyaki! Don't get me wrong, I like Shabu Shabu (cooked in water) too, but I LOVE LOVE LOVE their Sukiyaki sauce! It is their own special blend and it is SUPREMELY flavorful! I have been completely unsuccessful in my efforts to duplicate it though.. lol. They give you a hearty portion of veggies, rice noodles and meats. My personal recommendation- When you choose to cook your noodles, wait until the broth has reduced a little bit, then leave your noodles in the reduced broth for a few minutes to absorb the extra numminess flavoring.  All their food is FRESH!!  *Now the staff~ they are AWESOME! They are always there when ever you have a question or just want another glass of water. I have never had anything more than a 10 second wait, and even the other waiters come to check up on you too, so every one helps every one else there.   **ONE WARNING** They used to have a location on W Sahara, and due to landlord issues, they moved down to China Town. However the former landlord has decided to take up using the Swish name and logo, but the quality and service CANNOT match the original's! So, if you have a bad experience on W Sahara, I assure you, that company is NOT related at all to the Original Swish, locate on Spring Mountain road. **Really though**, if you are looking for something new, visiting Vegas, or just looking for a new Girls Night Out spot, THIS is the place to be!! And if you go in for lunch, be sure to say hi to Phil!  =)", "Date": "2011-04-02", "AuthorLocation": ""},{"Author": "Jennifer", "ReviewID": "oAVAwlzUdEnzjhGlH732-Q", "Overall": "3", "Content": "We really like this place. Its something a bit different from the usual meal out, and the quality and price are right on par. However lately, we have seen the quality go down a bit - maybe we were just going there too much and got bored of it. We are going to give them another chance soon. Shabu Shabu is the way to go !", "Date": "2015-08-28", "AuthorLocation": ""},{"Author": "Paddy", "ReviewID": "_DPMIRrcobZqeXtP6o4KZw", "Overall": "1", "Content": "Warning: When paying w/ a credit card they will ADD a tip to you on the iphone and show you just a signing screen. Sometimes they will even sign for it themselves. Happened to multiple people, if you're willing to come here even despite this review, PLEASE pay w/ cash or check with extreme caution of what they're trying to charge you. They will email you a receipt so that that will give them adequate time to get away with it, and deny assistance when you try to dispute it.  Service: The service is poor, inconsistent. They forgot our order, didn't pay any attention to what was being requested and ignored everybody us for the most part. We got our food late, the vegetables early, the meat at least 30 mins later (my friend got their meat 45 mins later). The meat was, even the expensive stuff, was less than mediocre.   Atmosphere: The place had an odor to it that would make you sick after sitting in it for a while. It should have been a sign when you go into a shabu shabu house and you see the only clientele there to be over weight non-asian people. not to say that you need to be a skinny asian to enjoy shabu shabu, but every good shabu shabu place I ever seen had a bunch of skinny asian people in it.  Conclusion: Do not come here, if you do anyways, make sure they dont over charge you for service they did not do.", "Date": "2013-07-16", "AuthorLocation": ""},{"Author": "Milly", "ReviewID": "dzKbxxn95Kcxoh4hebuB2A", "Overall": "5", "Content": "Used groupon Very kind waitress Delicious food Worth it  thank you  Ordered the Shabu shabu And the California roll", "Date": "2016-08-31", "AuthorLocation": ""},{"Author": "Misti", "ReviewID": "z5IlhGAnQOMVOcoQHUDDlw", "Overall": "4", "Content": "Sukiyaki is sneaking into my life as a new culinary obsession. I am on an unofficial quest to find every bowl of simmering soy goodness in the Vegas basin, so I headed to this location of Swish over the weekend.  The atmosphere is open and a bit sparse, but clean. Service is friendly, but perhaps a little inattentive, as we had to wrangle them for water refills. You sit at individual tables, and they provide private mini-ranges. Tabletop flames scare me a little, but now that I am adult, I do okay. When I was a Southern tot, however, I would make my mom blow out the flame on our pupu platter at our favorite Chinese restaurant. Otherwise, I would cry.  We went with the vegetable plate without the mushrooms, extra orders of tofu and cabbage. Their vegetable plate comes with broccoli--bonus! We were really excited by this vegetable appearance, and let the waitress know it. She thought we would appreciate this too:  It also comes with baby corn!  Um, yeah, that's kind of a problem, but I'll let you slide because the broccoli thing is that wonderful. The vegetables were all fresh, and the tofu was good.  Now, maybe this was in my head, or maybe I am just becoming a sukiyaki snob, but I felt as if their  broth  was a little more salty and less tangy, sweet. This could be a good thing or a bad thing because it either means it is indeed salty, or it means the other places are putting boats of sugar in their creations. I need more tastings to determine the correct answer.   For now, I think I would be just as happy and maybe happier having the vegetable plate at the Swish location closer to my house, but I am still a fan because sukiyaki is just that sukiyummy. One more salty encounter, however, and I will have to reevaluate.", "Date": "2010-06-23", "AuthorLocation": ""},{"Author": "Yvonne", "ReviewID": "dqSkAyJJsicPo2-D1t2AVw", "Overall": "3", "Content": "You always walk out feeling healthy. The thinly sliced beef and veggies in broth or sauce is enough to be filling without making you feel like you just ate a truck because it is light on carbs. You get a small portion of noodles but most of the meal is protein and vegetable. Good deal for the money. The sukiyaki can sometimes be a bit too salty, especially when it boils down. I prefer the shabu shabu.", "Date": "2007-12-16", "AuthorLocation": ""},{"Author": "April", "ReviewID": "C7CmL7nymESdvdelZngFUA", "Overall": "4", "Content": "First time here & I loved it. The meat was good and the mushrooms are a MUST. My daughter & I are big eaters and we shared a large meat & ordered side of mushrooms. We used a groupon and it was a great deal but even without discount I'll be back", "Date": "2016-07-13", "AuthorLocation": ""},{"Author": "Jannies", "ReviewID": "o57IdeXsaIA1Y4Dx-AMwUQ", "Overall": "4", "Content": "For a Shabu place in Las Vegas (as opposed to J-town in LA), this place is pretty decent.  In general, I give Asian foods in Vegas a handicap of .5 to 1 star additional simply because this area in general is not the land of diversity compared to large metropolitan cities (I.e. NY, SF, LA, etc.).  We craved Shabu Shabu and this appeared to be closest to the strip.  Service was excellent, sauces were good, prices were fair.  We will be back. :)", "Date": "2011-04-25", "AuthorLocation": ""},{"Author": "Leslie", "ReviewID": "PhNz8FDadAxeIShSXe9vuQ", "Overall": "5", "Content": "We stopped by this place on the way to Utah,  everyone in the car feeling for some shabu shabu. So we came here after a long drive.  I tried the spicy miso shabu shabu, with the Kobe chuck. The meat was very tender and fresh. Service was great. The waiters were very attentive.    Will definitely come back again.", "Date": "2016-11-24", "AuthorLocation": ""},{"Author": "Anais", "ReviewID": "CiCDE3GOPxhMDvk31ujhvg", "Overall": "5", "Content": "We came here for my birthday with my son  I had been to other shabu -shabu  locations in California so we decided  to give it a try at this place .  We saw the place  empty maybe just the staff and us  then I said to my self I'd it's empty it must be bad , it's true when they say : don't judge a book by its cover , this apply for food too lol! Anyways !! Long story short we sat and order everything looked clean the staff was just amazing . We got our food and it looked exactly  like our favorite restaurant in CA  and the taste was just the same , we were  so happy and amazed . We don't have to make excuses now to go to CA just to eat shabu-shabu  This is our number 1 shabu shabu in whole Vegas .  And I guess empty was better so we don't have to wait on a long line  and we have a fast service .  A must shabu shabu place to go 10 stars to this place", "Date": "2016-02-24", "AuthorLocation": ""},{"Author": "Hiru", "ReviewID": "vpQD3YWb4TMrLDZmdrjf7g", "Overall": "5", "Content": "Had lunch and first time trying shabu shabu at Swish today to celebrate one of my good friend's birthday. Had to say it was SO GOOD! The guy who served us was very attentive and he was very polite and most of all was very patient with us because we took such a long time deciding what to order.  He was so kind enough to explained us how shabu shabu works. We had Crispy garlic chicken and Sassy calamari for appatizers. Let me tell you that these are must try appatrizers! They were BOMB! For shabu shabu we ordered Kobe chuck and Prime rib eye, both on hungry portions and miso for broth. After everything was done the server I am assuming the owner gave us complementary ice cream for my friend which was so nice of him!!  Overall from food to service two thumbs up! Will be definitely going for seconds and thirds.", "Date": "2015-09-19", "AuthorLocation": ""},{"Author": "jon", "ReviewID": "iyGZzqq8gfKh27Tbwd7okQ", "Overall": "3", "Content": "I took my wife and my child here for a nice evening and was surprised that we were the only people in the whole place.  As others had mentioned, the condiments that appeared to be  fresh ginger  that had been on the table all day was troubling.    The food itself was pretty good.  The portions were decent frankly.  I didn't have any issue as others may have mentioned with the size of the dishes as I had plenty to take home.    The main issue I had was when it came to paying.  The check came, and I put my mastercard on the check.  The waitress said they didn't take credit cards.  now, this was AFTER we had ordered, ate and now were ready to pay.  The food is expensive here for what it is, and I didn't have the cash on me.  I told her she was going to have to work something out as I had multiple credit and debit cards that I could use, but not enough cash to cover the meal.  She eventually broke out some sort of attachment (no kidding) to her I-phone and I had to pay this route via paypal.  Now, perhaps this was an anomaly... but it sure as heck was one of the strangest ways I've ever paid for a restaurant before.    Overall, the food was decent, but not worth the price.  There are SOOOO many other places to go besides here.", "Date": "2013-05-01", "AuthorLocation": ""},{"Author": "Courtney", "ReviewID": "kibM-Szhx2Gf681uIMhsNQ", "Overall": "5", "Content": "YUM!  Took my kids here for lunch with a groupon. We were back for dinner later in the week. Kids split a hungry portion of Kobe Chuck with miso, I had the healthy portion of the same with spicy miso. It was so good! The service was wonderful - very kind and very attentive. Veggies were fresh and there were a lot of them included.  We will be back, again, often!", "Date": "2015-08-19", "AuthorLocation": ""},{"Author": "Monica", "ReviewID": "Pf2Ehy0i54D_R1vOd_OaSw", "Overall": "5", "Content": "I had such a great lunch here. I had gotten the Groupon of $30 for the lunch for two and it was a great deal. The service was excellent. The guys were super attentive and informative for us first timers. They took such good care of us.   The food was amazing. We both opted to do the sukiyaki. I got the ribeye and my hubby got the Kobe chuck. We also added the mushroom party a la carte because we love mushrooms. The mushroom portion was huge and filled with all kinds of yummy mushrooms. The steak was tender and good quality meat. The sukiyaki vegetables were plentiful and super fresh too.   Just a great experience. Definitely a place you have to check out. The place is clean, spacious and food is fab.", "Date": "2016-04-22", "AuthorLocation": ""},{"Author": "Viet", "ReviewID": "ZTzPnT1Gio-SA9JuToDkjQ", "Overall": "1", "Content": "I usually don't write reviews, but the service here is so terrible I just have to let people know about it. First off, when we entered the building, nobody greeted us or acknowledged our existence for a good seven minutes. If you know anything about good customer service this is a red flag. It took them a good while to  clean  and set up the table for us which we didn't mind. When we were seated, we noticed the table was still wet, sticky, and disgusting. We had to use the napkins on the table to finish cleaning it up ourselves. The server didn't do such a good job at explaining the menu to us since it was our first time, it really felt like she knew almost nothing about the food here lol. After ordering, we waited, and waited, and waited. By now I was getting irritated because there was only a total of 3 small families in the restaurant which I didn't understand why it took them so long to bring the food out just so we can cook it ourselves. Usually when you bring food out, you should try to bring them all out at the same time, after awhile they only brought us lettuce and a small plate of thinly sliced beef. They had also brought out the two plates of mushroom that we had ordered but ended up giving those to the family next to us. COME ON, SERIOUSLY. We waited some more and they brought out a plate of assorted seafood. The funny thing is by now, we still haven't gotten our bowls of rice or noodles to eat along with the rest of the food. wtf. At least bring us small empty bowls so we could have scooped our food into it. Not once did they apologize for taking so damn long to bring us our food. When they finally brought us our rice, they only brought two bowls. There were six of us. Now, I'm just really trying to keep my cool. By the time we were done eating, they still haven't brought out my brother's roll of sushi, so we just cancelled it. I was pissed because it was my idea to take the family out to eat for once and ended up going to this place. We ended up paying $80 for a small plate of beef, a small plate of seafood, and some mushroom, with a side of terrible customer service. A word of advice to the owners of this place, retrain your employees and brush up on your management skills along with your customer service skills. It's embarrassing, really. Don't waste your time and money here. You want some good hot pot and better service, go to Shabu Grill on silverado ranch, its all you can eat too for about $20 a person.", "Date": "2014-12-29", "AuthorLocation": ""},{"Author": "Pauline", "ReviewID": "O0NFunS-H-DZuhz2jrtkIA", "Overall": "4", "Content": "First time I tried Shabu Shabu so I can't compare it to anything else just yet! I felt that the selection and pricing was fairly reasonable and the service was great for our group of 6. Granted, there wasn't too many people in the restaurant, but still. Good service is good service!  Will try some other Shabu Shabu spots soon but overall, a good experience for my first time!", "Date": "2012-08-22", "AuthorLocation": ""},{"Author": "Suzanne", "ReviewID": "DKbseh-al78UqslpE_X7zA", "Overall": "4", "Content": "I really liked this place. My friend got a groupon and took me here for lunch because he knows I love all things hot pot and shabu. I can't really compare their prices but this is the only shabu place I've been to in Vegas. I think for lunch it's a great deal! 12 bucks for 4oz portion of ribeye plus rice and veggies. For the broth you can go with soy, spicy miso or seaweed. I picked the spicy miso because it sounds the most flavorful.  When I went in the restaurant it was pretty empty so we got seated right away food came really fast and this place doesn't charge more for extra broth or extra sauce :). This is a huge bonus!  The beef was very tender and delicious. I only dipped it in for a few seconds until it turned color so it didn't get too tough. The vegetables were mostly cabbage but it was a good portion. I think my favorite part were the condiments they gave you on the side. In addition to ponzu and sesame sauce, which were delicious they also had hot sauce, green onions, grated garlic and my favorite grated radish!  I would definitely come here again for shabu. I left feel very full and very satisfied.", "Date": "2016-03-25", "AuthorLocation": ""},{"Author": "SLiMsTer", "ReviewID": "590j5yBOL3PnH7H3CDGDIQ", "Overall": "5", "Content": "Must try the spicy miso and sukiyaki! And the meat quality was in point. I also love their sesame sauce", "Date": "2016-09-30", "AuthorLocation": ""},{"Author": "Manju", "ReviewID": "OaBd_3T10hgAfJ0xjvGQWQ", "Overall": "2", "Content": "This place went to drain last few years. Look like they bring food from microwave heated. Order few rolls and chicken teriyaki for our kids. Salad was horrible taste and feel like you eat something smell like a toilet. Only two stars I give that lady was nice to my kids. I never come back this place and hopefully they will close soon and stay out of business.", "Date": "2015-11-19", "AuthorLocation": ""},{"Author": "Allen", "ReviewID": "MIKN30atoZSIqoFrlLvDLw", "Overall": "4", "Content": "I'm not a big fan of this type of Asian cuisine, but I will eat once in a while. This place is pretty good. The tuna appetizer was very good. The place looked clean and the staff was nice. If you like this type of cuisine, I would recommend it.", "Date": "2013-09-09", "AuthorLocation": ""},{"Author": "C", "ReviewID": "A8ULArVK5bliVRs8ovdqWA", "Overall": "4", "Content": "Shabu was okay. I was disappointed that there was not that much of a variety of seafood and 40$ for all you can eat seafood wasn't really worth it. Also the soup had no flavor whatsoever. 40$ for some frozen salmon, other fish, shrimp, and frozen mussels and frozen scallops.. also the waiters there spoke English but hard to understand. They were really nice though but really slow for there being no one there.", "Date": "2014-08-04", "AuthorLocation": ""},{"Author": "Monte", "ReviewID": "k0qXLHk7yx6aoN_yrJgc_g", "Overall": "5", "Content": "The miso hot pot was the best!! Service was amazing and we received so much garnishes and veggies to put in our pot, unlike other places. Will definitely return!", "Date": "2016-05-19", "AuthorLocation": ""},{"Author": "Monica", "ReviewID": "txeYTxxhs0zVTvbWYGrtKA", "Overall": "1", "Content": "So far, every restaurant i've tried in this plaza (just two lol...) have not been that great. The restaurant was completely empty at 12 pm...only one waitress working and a couple customers went into the restaurant after us and she seemed quite frantic. Took a while for the food...a tiny plate of veggies with broth that tasted weird. Ponzu sauce had a strange taste to it. Meat still looked frozen and was not great at all...miso had a weird sour taste. Overall, I didn't like it. Sesame sauce was good, but I probably won't come here again...", "Date": "2011-11-09", "AuthorLocation": ""}]}